export default[
  {
    "url": "https://www.youtube.com/shorts/7fpOgugR0fk",
    "title": "Why Should You Use LangChain for Your AI Projects?",
    "youtuber": "@NaveedSarwarOfficial",
    "youtuber_md5": "396948928f9eeeec7b8ebd29a5f170e6",
    "video_url": "https://rr4---sn-jvhj5nu-2iad.googlevideo.com/videoplayback?expire=1782320562&ei=Urk7apSQIqyAkucP17jZmQI&ip=r2f94139124297a3f14fd991957cc7b28&id=o-AEnsU2B3pHlFci-yohKU3K_rk5PayhqgYeKapfxo4cTj&itag=18&source=youtube&requiressl=yes&xpc=EgVo2aDSNQ%3D%3D&met=1782298962%2C&mh=YC&mm=31%2C29&mn=sn-jvhj5nu-2iad%2Csn-ab5l6ny7&ms=au%2Crdu&mv=m&mvi=4&pl=19&rms=au%2Cau&ctier=SH&initcwndbps=3641250&bui=ARmQxEXze7XwvKjfO4p8e-vMrAkIo2vxhuVB9UaTxp-GKSwVQ1KoA9t5OQBs3l8QBGfMjarlzoB9aegL&spc=SQ-umlROqveYIoX02z5IZSIxweXA74rk6JSw99hCOPOSX1ygR3QvXpY&vprv=1&svpuc=1&mime=video%2Fmp4&ns=W9-iphwgy1kb7w59NToTnrUW&rqh=1&cnr=14&ratebypass=yes&dur=37.291&lmt=1756211364503778&mt=1782298649&fvip=3&fexp=51565116%2C51565681%2C51987687&c=WEB&sefc=1&txp=6310224&n=LdZ7zUAu2LYSbKBXz&sparams=expire%2Cei%2Cip%2Cid%2Citag%2Csource%2Crequiressl%2Cxpc%2Cctier%2Cbui%2Cspc%2Cvprv%2Csvpuc%2Cmime%2Cns%2Crqh%2Ccnr%2Cratebypass%2Cdur%2Clmt&sig=AHEqNM4wRQIhALSDFbTnJzC4PW4vNrDv0sYh-jRVOC43Qt-Do0yCpOpIAiA5dQi-M5CnoxdWHIomKH9K7Q7DtNDqJGcEkZOMH3U5kg%3D%3D&lsparams=met%2Cmh%2Cmm%2Cmn%2Cms%2Cmv%2Cmvi%2Cpl%2Crms%2Cinitcwndbps&lsig=APaTxxMwRgIhAPi7g9cUXxMW6nJY0_ksM58T9fuGmNlwIKA-E4aBRqsYAiEAtrNECfYDnTXEuwXph6_Ht-n_ImFvoEQzxR2qeLDhkeU%3D",
    "video_length": 37,
    "likes": 300,
    "views": 16454,
    "date_posted": "2024-09-23T09:51:19.000Z",
    "description": "Curious about LangChain? Discover how this powerful tool simplifies building language model-powered applications. Learn about its features, integration capabilities, and how it can elevate your AI projects to the next level!\n\nWant to dive deeper into AI tools like this? Follow me now for more! 🚀\n\n#LangChain #AI #MachineLearning #AITools #TechInsights #ArtificialIntelligence #DataScience #AIFrameworks #LLM\n\n#naveed #naveedsarwar #techlosetsolutions\n\n✅ Stay connected with me for assistance and updates:\n\n📘Naveed Trainer Instagram: https://www.instagram.com/naveedtrainer/\n\n📘Naveed Trainer Facebook: https://www.facebook.com/naveedtrainerofficial/\n\n📘Naveed Trainer TikTok:https://www.tiktok.com/@devnaveedsarwar?is_from_webapp=1&sender_device=pc\n\n📚Join our Facebook Group: https://www.facebook.com/groups/learnwithnaveedsarwar/\n\n👔LinkedIn: https://www.linkedin.com/in/naveed-software-engineer/?locale=en_US\n\n🐦Twitter: https://twitter.com/naveed_trainer\n\n🌐Website: https://techloset.com/\n\n📘Naveed Trainer WhatsApp: Wanna connect with me on WhatsApp? click here https://www.techloset.com/naveed-whatsapp\n\nFeel free to reach out and learn with us! 🚀📖",
    "num_comments": 6,
    "video_id": "7fpOgugR0fk",
    "channel_url": "https://www.youtube.com/@NaveedSarwarOfficial",
    "preview_image": "https://i.ytimg.com/vi/7fpOgugR0fk/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYUCBWKGUwDw==&rs=AOn4CLB9DfXkEE_BfMFcV6gJGOK2jfll4Q",
    "shortcode": "7fpOgugR0fk",
    "verified": false,
    "handle_name": "Naveed Sarwar",
    "avatar_img_channel": "https://yt3.ggpht.com/7PcBwmvtVyOTQgS2LcV5XtxXe8J1wt_HE47YmyFUHXFZl28sFYr5G_QF2Jc7vocXRttB8Arn2NY=s88-c-k-c0x00ffffff-no-rj",
    "is_sponsored": false,
    "related_videos": null,
    "license": null,
    "viewport_frames": "360x640 / -",
    "current_optimal_res": "360x640@30 / 360x640@30",
    "codecs": "avc1.42001E, mp4a.40.2 / mp4a.40.2",
    "color": "bt709",
    "quality": "hd2160",
    "quality_label": "2160p",
    "post_type": "short",
    "youtuber_id": "UCJ3J6JsgRIq0S0tQ_uE1Xnw",
    "transcript": "एआई या जनरेटिंग एआई के बारे में आपने बहुत सारी हाइप सुनी होगी कि आजकल इसका बहुत ट्रेंड है इसको हमें लर्न करना चाहिए लेकिन जब हम youtube2 ए एक्सपर्ट बनना चाहते हैं तो हमें उसमें से एक लैंग चेन टूल है उसके अंदर अपनी एक्सपर्टीज बनानी है क्योंकि लैंग चन एक ऐसा टूल है जिसकी मदद से आप जितने भी एलएल एम्स हैं या जनरेट आईआई के मॉडल्स हैं उनको यूज कर सकते हैं उनके ऊपर डेवलपमेंट कर सकते हैं उनकी मदद से हम किलीप",
    "formatted_transcript": [
      {
        "start_time": 80,
        "end_time": 5000,
        "duration": 4920,
        "text": "एआई या जनरेटिंग एआई के बारे में आपने"
      },
      {
        "start_time": 2760,
        "end_time": 7120,
        "duration": 4360,
        "text": "बहुत सारी हाइप सुनी होगी कि आजकल इसका"
      },
      {
        "start_time": 5000,
        "end_time": 10080,
        "duration": 5080,
        "text": "बहुत ट्रेंड है इसको हमें लर्न करना चाहिए"
      },
      {
        "start_time": 7120,
        "end_time": 10080,
        "duration": 2960,
        "text": "लेकिन जब हम"
      },
      {
        "start_time": 13879,
        "end_time": 18439,
        "duration": 4560,
        "text": "youtube2 ए एक्सपर्ट बनना चाहते हैं तो"
      },
      {
        "start_time": 16359,
        "end_time": 20080,
        "duration": 3721,
        "text": "हमें उसमें से एक लैंग चेन टूल है उसके"
      },
      {
        "start_time": 18439,
        "end_time": 22880,
        "duration": 4441,
        "text": "अंदर अपनी एक्सपर्टीज बनानी है क्योंकि"
      },
      {
        "start_time": 20080,
        "end_time": 25199,
        "duration": 5119,
        "text": "लैंग चन एक ऐसा टूल है जिसकी मदद से आप"
      },
      {
        "start_time": 22880,
        "end_time": 27800,
        "duration": 4920,
        "text": "जितने भी एलएल एम्स हैं या जनरेट आईआई के"
      },
      {
        "start_time": 25199,
        "end_time": 30640,
        "duration": 5441,
        "text": "मॉडल्स हैं उनको यूज कर सकते हैं उनके ऊपर"
      },
      {
        "start_time": 27800,
        "end_time": 33640,
        "duration": 5840,
        "text": "डेवलपमेंट कर सकते हैं उनकी मदद से हम"
      },
      {
        "start_time": 30640,
        "end_time": 33640,
        "duration": 3000,
        "text": "किलीप"
      }
    ],
    "hashtags": null,
    "tags": [
      "naveedsarwar",
      "naveed sarwar",
      "naveed",
      "sarwar",
      "Naveed Sarwar",
      "LangChain",
      "AI projects",
      "machine learning",
      "natural language processing",
      "language models",
      "AI tools",
      "LangChain tutorials",
      "AI integration",
      "langchain",
      "langchain tutorial",
      "langchain for beginners",
      "what is langchain used for",
      "langchain for developers",
      "langchain rag",
      "langchain tools",
      "what is langchain",
      "what is langchain good for",
      "langchain python",
      "langchain agents",
      "langchain in python",
      "langchain project",
      "langchain tutorials"
    ],
    "next_recommended_videos": null,
    "recommended_videos": null,
    "transcript_language": [
      {
        "language": "Hindi (auto-generated)",
        "auto_translate": true
      }
    ],
    "chapters": null,
    "transcription_language": null,
    "is_age_restricted": false,
    "channel_url_decoded": "https://www.youtube.com/@NaveedSarwarOfficial",
    "category": "Education",
    "audio_tracks": [],
    "made_for_kids": false,
    "player_notification_text": null,
    "ai_content_label": false,
    "timestamp": "2026-06-24T11:02:49.306Z",
    "input": {
      "url": "https://www.youtube.com/shorts/7fpOgugR0fk",
      "country": "",
      "transcription_language": ""
    }
  },
  {
    "url": "https://www.youtube.com/watch?v=Ty8gcCKuwNI",
    "title": "What is RAG ? | Completely Explained in 15 Minutes",
    "youtuber": "@ApnaCollegeOfficial",
    "youtuber_md5": "0e53da42f217650527771ffef0a13171",
    "video_url": "https://rr3---sn-u1woc5-5m.googlevideo.com/videoplayback?expire=1782320563&ei=U7k7avTEFLuD6dsPxr7wkA8&ip=r85f38d207cecdc76e815f198842f537b&id=o-ADrAYcy_By68dMSl6G7x8XtTLP4Gz74fn8-dJ7XQEmQP&itag=18&source=youtube&requiressl=yes&xpc=EgVo2aDSNQ%3D%3D&cps=620&met=1782298963%2C&mh=mp&mm=31%2C26&mn=sn-u1woc5-5m%2Csn-avn7ln7l&ms=au%2Conr&mv=m&mvi=3&pl=19&rms=au%2Cau&initcwndbps=440000&bui=ARmQxEXbgNXVfbCzN7WWm3l2pq95_rKoCXEr7T9Cj5Nii7ZUbq1WTzwANfs-nGn4CMjwkYGtZ28O7sJ2&spc=SQ-umjMTzzgbBDzmRu_331d_KrmIV_d6P9eBj8MQN0H3I1YJk7kUsl-jbxg&vprv=1&svpuc=1&mime=video%2Fmp4&ns=UiNBFTzOm0bJPiFp1VjMTB0W&rqh=1&gir=yes&clen=45342039&ratebypass=yes&dur=1044.062&lmt=1777060604346863&mt=1782298649&fvip=2&fexp=51565116%2C51565682%2C51946838%2C51987687%2C52017146&c=WEB&sefc=1&txp=5538534&n=waLNLpTMbYoX80VZ&sparams=expire%2Cei%2Cip%2Cid%2Citag%2Csource%2Crequiressl%2Cxpc%2Cbui%2Cspc%2Cvprv%2Csvpuc%2Cmime%2Cns%2Crqh%2Cgir%2Cclen%2Cratebypass%2Cdur%2Clmt&sig=AHEqNM4wRQIgQnKzCgAI0LXgNJd3PGRWBJB7VdMLbAkr49sFaX3FrQUCIQC7UTgC38uI5gR9SsQurzOtGX_wgdnOMeaFEXO08oVEpQ%3D%3D&lsparams=cps%2Cmet%2Cmh%2Cmm%2Cmn%2Cms%2Cmv%2Cmvi%2Cpl%2Crms%2Cinitcwndbps&lsig=APaTxxMwRgIhAMZ2FUJMTY8-RgLzEYUKHnFKVGyi2-fD3M_ScyVLqA1nAiEAj99BVm9B510MW8J0UvCYY_U8N64axbVCzwR-yV3fJH8%3D",
    "video_length": 1044,
    "likes": 13425,
    "views": 509197,
    "date_posted": "2026-04-24T16:25:57.000Z",
    "description": "🚀 Get Placement Ready & learn from the best 👇\nNo.1 Online Tech Placement Batches : https://linktr.ee/apnacollege.in\n\n📌 10 RAG Architectures: https://drive.google.com/file/d/1kO4AwaIGYYaxFM3BDWLbmpmv8U3LyKxI/view?usp=sharing\n\nShradha Ma'am community - share your progress\nInstagram : https://www.instagram.com/shradhakhapra\nLinkedIn : https://www.linkedin.com/in/shradha-khapra/\n\nTimestamps\n00:00 RAG Explained\n03:45 RAG Benefits over Traditional LLM\n6:00 Complete RAG Pipeline\n10:53 Tech Implementation Pillars\n12:21 RAG Architecture & Use cases",
    "num_comments": 503,
    "subscribers": 7680000,
    "video_id": "Ty8gcCKuwNI",
    "channel_url": "https://www.youtube.com/@ApnaCollegeOfficial",
    "preview_image": "https://i.ytimg.com/vi_webp/Ty8gcCKuwNI/maxresdefault.webp",
    "shortcode": "Ty8gcCKuwNI",
    "verified": true,
    "handle_name": "Apna College",
    "avatar_img_channel": "https://yt3.ggpht.com/FEcjRtez5od8UowDo6tTt9WlE-MrIFEmcwPMTORmK9Swk6KCklOmA3xfIG9WuLWfNYfNThQE=s48-c-k-c0x00ffffff-no-rj",
    "is_sponsored": false,
    "related_videos": null,
    "license": null,
    "viewport_frames": "640x360 / -",
    "current_optimal_res": "640x360@30 / 640x360@30",
    "codecs": "avc1.42001E, mp4a.40.2 / mp4a.40.2",
    "color": "bt709",
    "quality": "hd1080",
    "quality_label": "1080p60",
    "post_type": "post",
    "youtuber_id": "UCBwmMxybNva6P_5VmxjzwqA",
    "transcript": "हाई एवरीवन। एंड टुडे सेशन इज़ गोइंग टू बी अ वन स्टॉप टुटोरियल टु अंडरस्टैंड अ रैक व्हिच इज़ रिट्रीवल ऑर्गमेंटेड जनरेशन। नाउ इट साउंड्स कॉम्प्लिकेटेड बट इट्स एक्चुअली अ वेरी सिंपल कॉन्सेप्ट ऑफ़ एआई। रैग्स आज की डेट में बहुत ज्यादा पॉपुलर हैं। बिकॉज़ दे आर वन ऑन ऑन ऑन ऑन ऑन ऑन ऑन ऑन ऑन ऑफ़ द मोस्ट प्रैक्टिकल एप्लीकेशनेशंस ऑफ़ एआई इन द रियल वर्ल्ड। ऑलमोस्ट हर एक डोमेन के अंदर हमें रैग के एप्लीकेशनेशंस देखने को मिलते हैं। वेदर इट बी कस्टमर सपोर्ट, मेडिकल, लीगल, फाइनेंस, कंप्लायंस और रिसर्च। इनफैक्ट इफ आई शेयर अ पर्सनल एक्सपीरियंस, रिसेंटली आई गॉट माय ब्लड टेस्ट डन। एंड जिस एप्लीकेशन के ऊपर पूरी ब्लड रिपोर्ट आती है, वहां पर आई गॉट एन एआई जनरेटेड समरी फॉर माय रिपोर्ट अलोंग विद एफएक्यू स्पेसिफिक टू माय पर्सनल डेटा एंड उसके साथ में सम पर्सनल सजेशंस। नाउ दिस इज अ कैपेबिलिटी जो नॉर्मल सिस्टम्स के पास जैसे चार्जर जीपीडी हो गया, जेमिनाई हो गया उनके पास नहीं होती बिकॉज़ दे डोंट हैव एक्सेस टू दिस पर्टिकुलर डेटा। बट दिस इज़ अ कैपेबिलिटी जो बहुत सारी एंटरप्राइज लेवल एप्लीकेशंस के पास आज की डेट में आ रही है बिकॉज़ ऑफ़ रैक्स। तो उसी को आज के सेशन के अंदर हम इन डेप्थ समझने वाले हैं। सो वी विल कवर व्हाट एक्जेक्टली आर रैग्स? व्हाई आर दे सो पॉपुलर। वी विल टॉक अबाउट दी एंटायर रैग पाइपलाइन एंड उसके साथ में वी विल डिस्कस सम ऑफ़ द मोस्ट पॉपुलर रैग आर्किटेक्चर एंड यूज़ केसेस व्हिच आर एक्चुअली बीइंग यूज़्ड इन द इंडस्ट्री। नाउ टू अंडरस्टैंड रैग, लेट्स टेक टू केसेस। केस वन है हमारे स्टूडेंट वन का जिसका कल एक एग्जाम है। तो आज उनके पास बहुत सारी बुक्स हैं। द स्टूडेंट्स गोइंग टू लर्न अ लॉट, दे आर गोइंग टू मेमोराइज़ अ लॉट। एंड डिपेंडिंग ऑन देयर लर्निंग्स एंड मेमोराइजेशनंस। कल एग्जाम में जो भी क्वेश्चंस आएंगे उसको ये स्टूडेंट आंसर करके आएगा। दिस इज हाउ आर नॉर्मल एलएलएम्स लाइक जीपीटी, जेमिनाई एंड क्लॉड वर्क्स। बेसिकली जो भी हमारे एलएलएम्स होते हैं, जो भी हमारे नॉर्मल मॉडल्स होते हैं, दे आर ट्रेंड ऑन लार्ज डेटा सेट्स। एंड उसके बाद एक बार ट्रेनिंग हो जाती है मॉडल की, तो कोई भी यूजर जब कोई नई क्वेरी को क्रिएट करेगा, सो दिस एलएलएम बेस्ड ऑन देयर ट्रेनिंग, दे आर गोइंग टू प्रोड्यूस और दे आर गोइंग टू जनरेट सम आंसर और जनरेट सम कंटेंट। एंड यहां से हमारे पास कीवर्ड आता है जनरेशन। नाउ लेट्स टेक केस टू। केस टू के अंदर हमारे पास स्टूडेंट टू है जिसका भी कल एग्जाम है। इस स्टूडेंट के पास भी बहुत सारी बुक्स हैं जिससे ये स्टूडेंट लर्न करेगा, मेमोराइज करेगा। पर कल जब इस स्टूडेंट का एग्जाम होगा इट्स गोइंग टू बी एन ओपन बुक एग्जाम। मतलब स्टूडेंट को अलाउड होगा दैट दे कैन एक्सेस द बुक। दे कैन वेरीफाई फैक्ट्स। दे कैन वेरीफाई इनफार्मेशन इन रियल टाइम। दे कैन लुक फॉर अप टू डेट इनफार्मेशन इन द बुक। तो हाई चांसेस ये है कि स्टूडेंट टू एग्जाम के अंदर बेटर परफॉर्म करेगा बिकॉज़ दे आर एबल टू लुक अप इनफार्मेशन इन द रियल टाइम। एंड दिस इज एक्जेक्टली हाउ रैग वर्क्स। तो रैग इज नॉट अ सिंगल टेक्नोलॉजी। रैग इज बेसिकली अ टेक्निक जिसको हम यूज करते हैं अपने मॉडल्स के जो भी आंसर्स वो जनरेट करते हैं उसकी एक्यूरेसी को उसकी क्वालिटी को इंप्रूव करने के लिए। एंड हाउ डस इट वर्क? बेसिकली रैक्स के अंदर वी अलाउ आवर एलएलएम। वी अलाउ आवर मॉडल टू एक्सेस अ रियल टाइम एंड अप टू डेट डेटाबेस। जिसके अंदर कोई रेलेवेंट डेटा स्ट होता है जिसको हमारा मॉडल रियल टाइम के अंदर एक्सेस कर पाएगा एंड उसके बेसिस पर कुछ रेलेवेंट आंसर्स को जनरेट कर पाएगा। तो नेचुरली दीज़ आंसर्स दे आर गोइंग टू बी मोर एक्यूरेट, दे आर गोइंग टू बी मोर अप टू डेट एंड दे आर आल्सो गोइंग टू बी मोर कॉन्टेक्स्ट अवेयर। कॉन्टेक्स्ट अवेयर का यहां पर क्या मतलब है? जैसे लेट्स सपोज वी बुक द फ्लाइट एंड इट गॉट डिलेड। तो हम नॉर्मल किसी भी चार्ज जीपीडी या जेमिनाई जैसे टूल के पास जाएंगे और सीधा पूछेंगे व्हाई इज माय फ्लाइट डिलेड? तो इन टूल्स के पास एक्सेस नहीं है कि हमने कौन सी फ्लाइट को बुक किया था? हु एक्सैक्टली आर वी वो फ्लाइट एक्सक्टली डिलेड क्यों है? क्या है उस फ्लाइट का स्टेटस? बट जिस एयरलाइन से या जिस वेबसाइट से हमने उस फ्लाइट को बुक किया होगा वहां पर इफ देयर इज़ अ रैक बेस्ड कस्टमर सपोर्ट चैटबॉट एंड उससे डायरेक्टली जाकर हम पूछेंगे व्हाई इज माय फ्लाइट डिलेड एंड इफ वी आर लॉक्ड इन तो वो जो एजेंट है उसके पास ऑलरेडी रेलेवेंट इनफार्मेशन होगी कि हम एक्जेक्टली कौन है? हमने कौन सी फ्लाइट उस वेबसाइट से बुक की थी? उस फ्लाइट का अराइवल टाइम, डेस्टिनेशन एंड पीएनआर सारी इनफार्मेशन ऑलरेडी हमारे एजेंट के पास होगी। एंड दिस एजेंट विल बी एबल टू गिव अस मोर स्पेसिफिक आंसर। जबकि नॉर्मल टूल्स हमें एक जेनेरिक सा रिस्पांस जनरेट करके देते हैं। एंड दिस इज व्हाई रैग्स आर सो पॉपुलर। तो रैग्स इसीलिए बहुत ज्यादा यूज़फुल है इंडस्ट्री के अंदर बिकॉज़ एलएलएम्स के अंदर नेचुरली कुछ शॉर्टकमिंग्स होती हैं। कुछ उनके वीक पार्ट्स होते हैं जिसको रैक की हेल्प से हम ओवरकम करने की कोशिश करते हैं। तो रैक्स के बहुत सारे बेनिफिट्स हैं। फर्स्ट ऑफ़ ऑल दे रिड्यूस हेलुसिनेशन। जितने भी हमारे एलएलएम्स होते हैं समटाइम्स दे बिकम ओवर कॉन्फिडेंट एंड जब उन्हें फैक्ट्स या फिर जब उन्हें कोई सही चीज नहीं पता होती सो दे समटाइ्स मेक अप फैक्ट्स और दे प्रोड्यूस फॉल्स इनफेशन व्हिच वी कॉल हेलुसिनेशन। तो इसी चीज को मिटिगेट करने के लिए हम रैग आर्किटेक्चर को यूज़ कर सकते हैं। तो जब हम रैग्स को यूज़ करते हैं तो हमारे मॉडल के जो भी रिस्पॉन्सेस होंगे दे विल बी मोर ग्राउंडेड एंड दे विल बी बेस्ड मोर ऑन रियल डेटा। सेकंड बेनिफिट रैग्स का होता है दैट दे कीप नॉलेज अप टू डेट। जितने भी हमारे एलएलएम्स होते हैं या जितने भी हमारे मॉडल्स होते हैं उनका जनरली कोई ना कोई नॉलेज कट ऑफ डेट होता है। नॉलेज कट ऑफ डेट कहने का मतलब है कि मॉडल को ट्रेन करने के लिए जिस ट्रेनिंग डेटा को यूज़ किया गया है वो ट्रेनिंग डेटा इस डेट तक का है। जैसे GBT5 के लिए द नॉलेज कट ऑफ इज़ फॉर 30th सप्टेंबर 2024। जिसका मतलब है हमारा जो मॉडल है उसे करंट इवेंट्स के बारे में नहीं पता। तो ऐसे केसेस में अगर हम मॉडल को करंट इवेंट्स के बारे में एक्सेस देना चाहते हैं। सो दैट वी कैन गिव विद द हेल्प ऑफ़ रैग्स। उसके साथ में थर्ड बेनिफिट होता है दैट ड्रैग्स आर कॉस्ट इफेक्टिव। जनरली अगर किसी भी मॉडल को रैग से पहले अगर हमें कुछ नए डेटा की एक्सेस देनी होती तो उसके लिए या तो हमें मॉडल को ट्रेन करना पड़ता या फिर उसे फाइन ट्यून करना पड़ता व्हिच इज अ वेरी एक्सपेंसिव प्रोसेस। बट रैग्स की हेल्प से हम ट्रेनिंग को हम फाइन ट्यूनिंग को अवॉइड कर सकते हैं। एंड डायरेक्टली हम डेटा की एक्सेस दे सकते हैं टू द मॉडल। फोर्थ इसका बेनिफिट होता है दैट वी मेंटेन सम लेवल ऑफ़ डेटा प्राइवेसी। एंड दिस इज़ वेरी यूज़फुल एस्पेशली फॉर एंटरप्राइज लेवल। अगर कोई बड़े लेवल की कंपनी है तो वो नहीं चाहेंगे कि वो अपने इंटरनल या अपने सेंसिटिव डेटा की एक्सेस दें मॉडल को या उस डेटा को यूज करें मॉडल को ट्रेन करने के लिए या उसे फाइन ट्यून करने के लिए। तो ऐसे में कोई भी एंटरप्राइज लेवल की कंपनी या इनफैक्ट कोई भी ऑर्गेनाइजेशन अपने डेटा की जो प्राइवेसी है उसको मेंटेन कर पाते हैं। उन्हें ट्रेन नहीं करना पड़ता मॉडल को तो डेटा की पूरी एक्सेस नहीं देनी पड़ती। इनफैक्ट रैग आर्किटेक्चर जिस तरीके से वर्क करता है। रैग की पाइपलाइन जिस तरीके से वर्क करती है। हमारा जो मॉडल होता है वो एक टाइम पर पूरे के पूरे डेटाबेस को एक्सेस नहीं कर पाता। जो भी उसके पास क्वेरी आती है उस क्वेरी से रिलेटेड डेटाबेस के स्पेसिफिक पार्ट्स को ही हमारा मॉडल एक्सेस करता है। एंड दैट इज हाउ ऑर्गेनाइजेशनंस के अंदर हमारा सेंसिटिव डेटा कंप्लीटली एक्सपोज नहीं होता। एंड नाउ लेट्स अंडरस्टैंड हाउ डस रैग वर्क व्हाट इज द कंप्लीट रैग पाइपलाइन। नाउ वी ऑलरेडी नो हाउ अ नॉर्मल एलएलएम वर्क्स। हमारे पास जो भी यूज़र्स होते हैं वो कुछ क्वेरी करते हैं। उसके बेसिस पर हमारा मॉडल इज़ गोइंग टू जनरेट सम रिस्पांस। नाउ लेट्स टॉक अबाउट द रैग पाइपलाइन कि रैग कैसे वर्क करता है? रैक पाइपलाइन के दो मेन कॉम्पोनेंट्स होते हैं। फर्स्ट इज कॉल्ड द इंजेशन पाइपलाइन। सेकंड इज कॉल्ड द रिट्रीवल पाइपलाइन। नाउ दीज़ आर स्केरी वर्ड्स बट द कॉनंसेप्ट इज़ एक्चुअली वेरी सिंपल। सबसे पहले इंजेशन पाइपलाइन के बारे में बात करते हैं। इंजेशन पाइपलाइन बेसिकली मींस कि कैसे हम अपने स्टूडेंट के लिए अपनी ओपन बुक को प्रिपेयर करने वाले हैं। मतलब वो जो डेटा जिसकी एक्सेस हम मॉडल को देंगे उसको कैसे प्रिपेयर करेंगे। सबसे पहले वी गेट ऑल द डेटा। तो ये डेटा कुछ भी हो सकता है। इट कुड बी पीडीएफ, इट कुड बी सिंपल डॉक्यूमेंट्स, इट कुड बी एक्सेल फाइल्स। इट कुड बी एन एंटायर वेबसाइट और इट कुड बी द एंटायर कंपनीज़ इंटरनल डेटाबेस। तो जो भी हमारा डेटा सेट है वहां से हम यूज़फुल डेटा को एक्सट्रैक्ट करेंगे। एंड देन वी स्प्लिट दिस डेटा इंटू चंक्स। तो हम पूरे डेटा को एक साथ प्रोसेस नहीं करते। हम उसे स्मॉल पार्ट्स के अंदर डिवाइड करते हैं जिनको हम चंक्स कहते हैं। एक बार हमारे पास सारे के सारे चंक्स आ गए। देन वी आर गोइंग टू कन्वर्ट दीज़ चंक्स इंटू एंबेडिंग्स। एंबेडिंग्स क्या होती है? बेसिकली जितने भी हमारे सिस्टम्स या मॉडल्स होते हैं दे कैन नॉट प्रोसेस टेक्स्ट। वो सिर्फ नंबर्स को प्रोसेस कर सकते हैं। तो इसीलिए हमारा जितना भी टेक्स्ट है उसे हमें नंबर्स के अंदर कन्वर्ट करना पड़ेगा। एंड उस कन्वर्जन के लिए वी यूज़ सम एंबेडिंग एपीआई और सम एंबेडिंग मॉडल। तो बहुत सारे डिफरेंट-डिफरेंट मॉडल्स हैं जो इंडस्ट्री के अंदर अवेलेबल हैं। तो हम हर एक सेपरेट चंक के लिए उसकी सेपरेट एंबेडिंग को क्रिएट करते हैं। एंबेडिंग को हम टेक्निकल टर्म्स में वेक्टर एंबेडिंग भी कह सकते हैं। बिकॉज़ दिस विल बेसिकली बी अ वेक्टर ऑफ नंबर्स जो हमारे हर एक चंक को रिप्रेजेंट करते हैं। जैसे ही हमारे पास सारी की सारी एंबेडिंग्स आ गई। अब नेक्स्ट स्टेप होगा टू स्टोर देम इन अ वेक्टर डेटाबेस। वेक्टर डेटाबेस इज़ डिफरेंट फ्रॉम अ नॉर्मल डेटाबेस। ये वेक्टर डेटाबेस का नाम वेक्टर डेटाबेस इसलिए है क्योंकि ये वेक्टर एंबेडिंग्स को स्टोर करता है। बट दिस इज़ अ स्पेशल डेटाबेस। हमारे जितने भी नॉर्मल डेटाबेस होते हैं जैसे मोंगो डीबी हो गया, जैसे मायसक्यूएल हो गया। इन सारे डेटाबेस के अंदर हम कीवर्ड सर्च कर सकते हैं। कीवर्ड बेस सर्च कहने का मतलब है लेट्स सपोज आई हैव सम मेडिकल रिकॉर्ड्स जो मेरे डेटाबेस के अंदर स्टर्ड है। अगर मैं उसके अंदर सर्च करना चाहती हूं हार्ट अटैक सिम्टम्स तो मेरे डेटाबेस से वही डॉक्यूमेंट्स आएंगे जिसके अंदर ये कीवर्ड्स मेंशंड होंगे जिसके अंदर हार्ट अटैक सिम्टम्स ये तीनों कीवर्ड्स मेंशंड होंगे। वही डेटाबेस सर्च के अंदर आएंगे। पर वेक्टर डेटाबेस स्पेशल इसलिए होते हैं क्योंकि उसके अंदर हम सिंैटिक सर्च कर सकते हैं। सिमेंटिक सर्च बेसिकली मींस मीनिंग बेस्ड सर्च। जैसे लेट्स सपोज इन माय वेक्टर डेटाबेस आई हैव सम डॉक्यूमेंट रिलेटेड टू कार्डियक अरेस्ट। अब मैंने जो सर्च किया हार्ट अटैक सिम्टम्स एंड कार्डियक अरेस्ट। दोनों में कोई भी कीवर्ड मैच नहीं करता। बट दोनों का मीनिंग सिमिलर है। तो इसीलिए वेक्टर डेटाबेस रिजल्ट में मुझे ये पर्टिकुलर डॉक्यूमेंट भी रिटर्न करेगा जो एक नॉर्मल डेटाबेस रिटर्न नहीं करता। सो, दिस इज़ हाउ वी क्रिएट आवर वेक्टर डेटाबेस और आवर नॉलेज बेस जिसके अंदर हम अपनी एंबेडिंग्स को स्टोर करते हैं और डॉक्यूमेंट चंक्स को स्टोर करते हैं। एंड दिस एंटायर पाइपलाइन और प्रोसेस इज़ कॉल्ड द डेटा इंजेशन पाइपलाइन। [संगीत] इसके बाद आती है हमारी सेकंड पाइपलाइन व्हिच इज़ कॉल्ड द रिट्रीवल पाइपलाइन। रिट्रीवल पाइपलाइन के अंदर क्या होता है? दिस इज़ द फर्स्ट स्टेप। फर्स्ट स्टेप में हमारा जो भी यूजर है वो नॉर्मली कोई क्वेरी क्रिएट करेगा। अब इस क्वेरी को भी हमें एंबेडिंग्स के अंदर क्रिएट करना पड़ेगा। तो उसके लिए जो इंजेशन के टाइम पर हमने एंबेडिंग एपीआई यूज़ की थी उसी को हम यहां पर यूज़ करेंगे। एंड वी विल क्रिएट द एंबेडिंग। एक बार हमारा फर्स्ट स्टेप कंप्लीट हो गया। उसके बाद कम्स द सेकंड स्टेप व्हिच इज़ कॉल्ड द रिट्रीवल [संगीत] स्टेप। रिट्रीवल स्टेप के अंदर क्या होता है? बेस्ड ऑन द क्वेरी एंबेडिंग। हम क्वेरी से मैच करते हुए डॉक्यूमेंट्स को अपने वेक्टर डेटाबेस के अंदर सर्च करेंगे। सो इफ द क्वेरी इज़ रिलेटेड टू हार्ट अटैक सिम्टम्स, वी आर गोइंग टू एक्सट्रैक्ट कार्डियक अरेस्ट या सिमिलर डॉक्यूमेंट्स फ्रॉम द वेक्टर डेटाबेस। तो जितने भी हमारे डॉक्यूमेंट्स एक्सट्रैक्ट होंगे उसके लिए हम सिमेंटिक सर्च या सिमिलरिटी सर्च को यूज करते हैं। वो सारे के सारे रैंक्ड डॉक्यूमेंट्स हमारे पास आ जाएंगे। तो डेटाबेस से हमने क्या किया? कुछ पर्टिकुलर रेलेवेंट इनफेशन को एक्सट्रैक्ट कर लिया। एंड ये जो एक्सट्रैक्टेड इनफार्मेशन है इसको हम कहते हैं अपना कॉन्टेक्स्ट। [संगीत] अब ये जो कॉन्टेक्स्ट है ये हम अपने मॉडल को पास करेंगे। सो नाउ कम्स द थर्ड स्टेप व्हिच इज़ कॉल्ड ऑगमेंटेशन। ऑगमेंटेशन का मतलब है इंस्टेड ऑफ अ सिंपल क्वेरी वी आर गोइंग टू पास एन एंटायर प्र्पों्ट टू द मॉडल। प्र्प के अंदर दो पार्ट्स हैं। सबसे पहला हम ओरिजिनल क्वेरी को रखेंगे। एंड उसके साथ में वी आर गोइंग टू ऐड द कॉन्टेक्स्ट जो अभी हमें मिला है। तो उससे हमारा एक प्रम्प्ट क्रिएट होता है। मतलब ऑर्गमेंटेशन होती है एंड देन वी पास इट टू द एलएलएम। एंड उसके बाद हमारा फाइनल स्टेप आता है व्हिच इज़ कॉल्ड जनरेशन। जिसका मतलब है एलएलएम फाइनली किसी आंसर को जनरेट करेगा एंड वी रिटर्न दिस आंसर टू द यूजर। सो दिस इज व्हाई रैग्स आर कॉल्ड रिट्रीवल ऑगमेंटेड जनरेशन। जनरेशन क्यों? क्योंकि रैग्स किसी भी आंसर को, को रिस्पांस को, कंटेंट को जनरेट करने का काम करते हैं। एंड दिस जनरेशन इज़ नॉट सिंपल। दिस इज़ रिट्रीवल ऑर्गमेंटेड। मतलब पहले रिट्रीवल होता है एंड उसके बाद हम अपनी ओरिजिनल क्वेरी को ऑर्गुमेंट करते हैं। दैट इज़ व्हाई द जनरेशन इज़ रिट्रीवल ऑर्गमेंटेड जनरेशन इन रैक्स। नाउ लेट्स टॉक अबाउट सम ऑफ़ द टेक्निकल इंप्लीमेंटेशंस। नाउ थ्री थिंग्स मैटर अ लॉट व्हेन वी इंप्लीमेंट दिस पाइपलाइन। फर्स्ट बीइंग द चंकिंग स्ट्रेटजी वी आर यूजिंग। सेकंड बीइंग द एंबेडिंग मॉडल एंड थर्ड बीइंग द वेक्टर डेटाबेस वी हैव। इफ वी टॉक अबाउट चंकिंग स्ट्रेटजीस देयर आर अ लॉट ऑफ डिफरेंट टाइप्स ऑफ चंकिंग। फर्स्ट इज़ कॉल्ड फिक्स्ड साइज चंकिंग व्हेयर वी स्प्लिट द टेक्स्ट इंटू फिक्स्ड साइज चंक्स। फॉर एग्जांपल, वी आर क्रिएटिंग अ न्यू चंक आफ्टर एव्री 500 टोकंस। सो दिस इज़ वैरी सिंपल टू इंप्लीमेंट बट इट एक्चुअली हैज़ अ लॉट ऑफ़ ड्रॉबैक्स। द मोस्ट पॉपुलर ड्रॉबैक बीइंग दैट इट कैन ब्रेक आवर कॉनंटेक्स्ट मिड सेंटेंस। नेक्स्ट इज़ हायरार्किकल चंकिंग। व्हेयर वी क्रिएट आर चंक्स ऑन द बेसिस ऑफ़ डिफरेंट सेक्शंस। ऑर वी क्रिएट चंक्स फॉर एव्री पैराग्राफ। ऑर वी क्रिएट चंक्स फॉर एव्री सेंटेंसेस। सो दिस इज़ मोर कॉम्प्लेक्स टू इंप्लीमेंट बट इट्स एक्चुअली वेरी पॉपुलर फॉर प्रोडक्शन लेवल सिस्टम्स। थर्ड इज़ कॉल्ड सिमेंटिक चंकिंग। सो इन सिमेंटिक चंकिंग वी क्रिएट चंक्स ऑन द बेसिस ऑफ मीनिंग। सो वी कैन क्रिएट अ न्यू चंक व्हेनएवर देअर इज़ अ न्यू टॉपिक व्हिच इमरजज़ इन द डॉक्युमेंट्स। सो सिमेंटिक चंकिंग इज़ एक्चुअली अ स्लोअर प्रोसेस। बट इट प्रोड्यूसेस हाई क्वालिटी चंक्स। सो देयर आर अ लॉट मोर चंकिंग स्ट्रेटजीस दैट एक्सिस्ट एंड इफ वी वांट टू इंप्लीमेंट चंकिंग सो वन ऑफ द मोस्ट पॉपुलर लाइब्रेरीज इंक्लूड लैंगचेन लामा इंडेक्स एंड हेस्टैक। सेकंडली फॉर क्रिएटिंग एंबेडिंग्स वी हैव मल्टीपल पॉपुलर एंबेडिंग मॉडल्स व्हिच इंक्लूड ओपन एआईस टेक्स्ट एंबेडिंग्स थ्री। [संगीत] वी हेव जेमिनाई एंबेडिंग्स। इन द हगिंग फेस इकोसिस्टम वी आल्सो हेव सेंटेंस ट्रांसफॉर्मर्स दैट वी कैन यू। इफ वी टॉक अबाउट वेक्टर डेटा बेसेस, वी हैव अ लॉट ऑफ़ पॉपुलर ऑप्शंस। वी हैव क्रोमा डीबी, वी हैव फाइस, वी हैव पाइन कोन, वी हैव इलास्टिक सर्च एंड मेनी मोर वेक्टर डेटाबेस व्हिच आर अवेलेबल टु अस। नेक्स्ट लेट्स टॉक अबाउट सेवन ऑफ़ द मोस्ट रेलेवेंट रैग आर्किटेक्चर्स एंड यूज़ केसेस इन दी इंडस्ट्री। फर्स्ट इज़ द नाइव ऑर द स्टैण्डर्ड रैग। इट इज़ द सेम आर्किटेक्चर दैट वी हैव डिस्कस राइट नाउ। सो, इन दिस आर्किटेक्चर, वी हैव अ यूजर क्वेरी कमिंग इन। वी कन्वर्ट द क्वेरी इंटू एंबेडिंग्स एंड देन वी रिट्रीव द टॉप चंक्स व्हिच बिकम्स द कॉनंटेक्स्ट। वी ऐडेड टू द प्रम्प्ट एंड देन द मॉडल जनरेट सम रिस्पॉन्स फॉर अस। सो, दिस इज़ अ स्टैंडर्ड प्रोसेस दैट हपेंस इन दिस टाइप ऑफ़ आर्किटेक्चर, इज़ एक्चुअली अ लो कॉम्प्लेक्सिटी आर्किटेक्चर। सो, दिस इज़ हाइली सूटेबल फॉर क्रिएटिंग एफएक्यूस फॉर एनी पर्टिकुलर वेबसाइट ऑर फॉर क्रिएटिंग सिंपल सपोर्ट चैट बॉट्स विथ क्लीन डॉक्यूमेंटेशन। सेकंड इज़ कॉल्ड अ हाइब्रिड रैक। सो, इन अ स्टैंडर्ड रैक वी हैव अ प्योर वेक्टर सर्च दैट हपेंस, व्हिच इज़ ग्रेट फॉर मीनिंग बट वीक फॉर एक्सैक्ट मैचेस लाइक आईडीज़, लाइक नेम्स, ओर सम इंडस्ट्री स्पेसिफिक टर्म्स। [संगीत] सो व्हाट हाइब्रिड रैग डस इज़, इट कंबाइनस वेक्टर सर्च एंड कीवर्ड सर्च टू गेट अ बेस्ट ऑफ़ बोथ। सो हाइब्रिड रैग इज बेस्ट फॉर एंटरप्राइज लेवल सर्च एंड इवन फॉर ई-कॉमर्स सर्चेस। इनफैक्ट इन प्रोडक्शन लेवल सिस्टम्स हाइब्रिड सर्च इज अ वैरी कॉमन टाइप ऑफ रैग आर्किटेक्चर दैट वी गेट टू सी। थर्ड इज़ कॉल्ड अ रैग विद मेमोरी। सो अ स्टैंडर्ड रैग इट डस नॉट स्टोर पास्ट कन्वर्सेशन। सो इफ अ यूजर आस्क कैन यू एक्सप्लेन मोर अबाउट इट। द सिंपल ओर द स्टैंडर्ड रैग विल नॉट अंडरस्टैंड ओवर एक्साक्टली इज़ [संगीत] इट। सो द रैग नीड्स टू मेटेन सम सॉर्ट ऑफ़ हिस्ट्री टू रिमेंबर पास्ट कन्वर्सेशन्स एंड दैट इज व्हेयर रैग विद मेमोरी कम्स इन। सो व्हाट इट डज इट? इट क्रिएट्स अ सेपरेट मेमोरी लेयर ऑन टॉप ऑफ दी एकज़िस्टिंग आर्किटेक्चर टु मेंटेन अ रनिंग थ्रेड ऑफ़ द कन्वर्सेशन। एंड दिस टाइप ऑफ़ रैग आर्किटेक्चर इज़ ग्रेट फॉर क्रिएटिंग सपोर्ट असिस्टेंस एंड चैटबॉट्स। फोर्थ इज़ द ग्राफ रैग। सो इन अ स्टैंडर्ड रैग जितना भी डेटा होता है इट्स ट्रीटेड अस इंडिपेंडेंट चंक्स। सो इट्स बिकम वेरी डिफिकल्ट टू ट्रैक द रिलेशनशिप बिटवीन एंटिटीज़। तो, ग्राफ रैग के अंदर व्हाट डु वी डू, वी प्रिजर्व द रिलेशनशिप्स अमंग डिफरेंट डॉक्युमेंट्स, अमंग डिफरेंट चंक्स। बिकॉज़ वी स्ट्रक्चर आवर डेटा इन द फॉर्म ऑफ अ नॉलेज ग्राफ ऑर इन द फॉर्म ऑफ अ ग्राफ। तो इफ वी हैव ऑलरेडी लर्नड अबाउट ग्राफ, डेटा स्ट्रक्चर एंड डेटा स्ट्रक्चर्स एंड एल्गोरिदम्स। ओर इफ वी हैव यूज़्ड डेटा बेसेस लाइक Neo 4J। सो इट्स द सेम कॉन्सेप्ट हियर। तो यहां पर बेसिकली हमारी जो डिफरेंट एंटिटीज़ होती हैं डेटा के अंदर दे बिकम द नोड फॉर द ग्राफ। एंड द एजेस ऑफ द ग्राफ दे रिप्रेजेंट द रिलेशनशिप बिटवीन दीज़ एंटिटीज़। सो ग्राफ ट्रैक इज़ अ कॉम्प्लेक्स आर्किटेक्चर बट इट्स सूटेबल फॉर फ्रॉड डिटेक्शन, इट्स सूटेबल फॉर लीगल डोमेन, इट्स सूटेबल इवन फॉर रिसर्च। बेसिकली दिस टाइप ऑफ आर्किटेक्चर इज सूटेबल फॉर नॉलेज हैवी सिस्टम्स। मतलब ऐसे सिस्टम्स जिसके अंदर देयर आर अ लॉट ऑफ टर्म्स, देयर आर अ लॉट ऑफ थिंग्स व्हिच आर इंटररिलेटेड विथ ईच अदर। फिफ्थ आर्किटेक्चर इज़ कॉल्ड एजेंटिक रैक। नाउ देयर आर सम यूजर क्वेरीज़ दैट कांट बी रेसोल्व्ड विथ अ सिंगल रिट्रीवल ऑर अ सिंगल जनरेशन। फॉर एग्जांपल, देयर इज़ अ यूजर हु आस्क, कैन यू एक्सप्लेन द प्राइस हक ऑफ़ गोल्ड इन 2025 एंड कंपेयर विद अदर मेटल्स। नाउ, दिस सिंगल क्वेरी कैन नोट बी रेसलॉल्व विद अ सिंगल रिट्रीवल। और कैन नॉट बी रेसोल्व्ड वेल विद अ सिंगल रिट्रीवल। सो द सिस्टम नीड्स टू ब्रेक डाउन दिस क्वेरी इन मल्टीपल पार्ट्स। सबसे पहले तो सिस्टम को फिगर आउट करना पड़ेगा कि व्हेन वाज़ दिस प्राइस हक इन 2025। उसके साथ में इट नीड्स टू फिगर आउट द रीज़न बिहाइंड इट। प्लस इट आल्सो नीड्स टू कंपेयर इट विद अदर मेटल्स। तो बेसिकली वी नाउ हैव अ सेट ऑफ़ मल्टीपल क्वेरीज़। तो वी नीड मल्टीपल रिट्रीवल्स। एंड उसके साथ में सिस्टम विल आल्सो नीड एक्सेस टू सम एडिशनल टूल्स। जैसे वेब सर्च हो गया जैसे फाइनेंस एपीआईस हो गई। तो इस तरीके का जो सिस्टम होता है इट कैन बी बिल्ट विथ द हेल्प ऑफ एजेंटिक रैक। तो एजेंटिक रैक की जब हम बात करते हैं द सिस्टम्स आर मल्टीस्टेप देयर आर मल्टीपल रिट्रीवल्स इनवॉल्व्ड एंड उसके साथ में द सिस्टम नीड्स टू हैव सम लेवल ऑफ ऑटोनोमी फॉर कंप्लीटिंग द टास्क। नेक्स्ट इज़ कॉल्ड अ मल्टीडल रैग। जनरली द स्टैंडर्ड रैग्स दैट वी हैव। दे ओनली वर्क विथ टेक्स्चुअल डेटा। बट डेटा कैन बी इन एनी फॉर्म। सो मल्टीमॉडल रैग इज़ एबल टू प्रोसेस डेटा व्हिच इज़ इन द फॉर्म ऑफ टेक्स्ट, व्हिच इज़ इन द फॉर्म ऑफ वीडियोज़, इमेजेस एंड इवन ऑडिओज़। सो, दिस टाइप ऑफ़ रैग आर्किटेक्चर हैज़ ग्रेट यूज़ केसेस इन द मेडिकल इंडस्ट्री व्हेयर वी हैव एक्स रेज़ व्हेयर वी हैव रिपोर्ट्स एंड ऑल्सो इन सर्विलेंस एंड सिक्योरिटी। सो, फाइनली, वी हैव द सेल्फ रैग ऑर द सेल्फ रिफ्लेक्टिव रैग। अब यह जो रैग आर्किटेक्चर है, यह फर्स्ट टाइम में फाइनल आउटपुट को जनरेट नहीं करता। बट, यह फर्स्ट टाइम में जो भी रिस्पांस जनरेट करता है, दैट इज़ कॉल्ड द ड्राफ्ट रिस्पांस। एंड व्हाट दिस टाइप ऑफ़ रैग आर्किटेक्चर डज़ इज़ यह वो ड्राफ्ट रिस्पांस को पहले एनालाइज़ करता है। पहले खुद से क्रिटिक करता है कि इफ दैट रिस्पांस इज़ गुड इनफ। क्या और कोई इनफेशन तो फिगर आउट करने की या सर्च करने की जरूरत नहीं है? सो उससे क्या होता है? दिस रैग इज़ एबल टू इंप्रूव द रिस्पांस बाय एनालाइजिंग इट बिफोर हैंड। सो दिस टाइप ऑफ़ रैग आर्किटेक्चर इज़ ग्रेट फॉर इंडस्ट्रीज व्हिच आर रिसर्च हैवी और व्हिच हैव स्ट्रांग रेगुलेशंस। आल्सो देयर आर मोर टाइप्स ऑफ़ रैग आर्किटेक्चर दैट एक्सिस्ट। सो आई हैव इंक्लूडेड सम ऑफ़ देम इन अ पीडीएफ डॉक्यूमेंटेशन जिसका लिंक आपको नीचे डिस्क्रिप्शन बॉक्स के अंदर मिल जाएगा। उसके साथ में इंडस्ट्री के अंदर जनरली इंस्टेड ऑफ़ यूजिंग स्टैंड अलोन आर्किटेक्चर्स। व्हाट हैपेंस इज कि प्रोडक्शन लेवल पर मल्टीपल आर्किटेक्चर्स को भी कंबाइन किया जाता है। सो दैट इज़ आल्सो अ प्रैक्टिस दैट हेल्प्स इंप्रूव द परफॉर्मेंस ऑफ द सिस्टम्स। तो आई होप कि आज के सेशन से हमें रैग के बारे में कंप्लीट डिटेल पता चली होगी एंड हमें क्लियरली समझ में आया होगा कि रैग एग्जैक्टली होता क्या है? व्हाई इज़ रैग सो पॉपुलर एंड व्हाट आर द पॉपुलर रैग आर्किटेक्चर्स दैट एक्सिस्ट इन द इंडस्ट्री। इसके बाद इफ यू हैव एनी डाउट्स रिलेटेड टू रैग और एआई? और इफ यू नीड अ कंप्लीट टुटोरियल टू इंप्लीमेंट रैग यूजिंग Python, यू कैन लेट मी नो इन द कमेंट्स। आज के लिए इतना ही। मिलते हैं नेक्स्ट सेशन के अंदर।",
    "formatted_transcript": [
      {
        "start_time": 0,
        "end_time": 4080,
        "duration": 4080,
        "text": "हाई एवरीवन। एंड टुडे सेशन इज़ गोइंग टू बी"
      },
      {
        "start_time": 1680,
        "end_time": 6560,
        "duration": 4880,
        "text": "अ वन स्टॉप टुटोरियल टु अंडरस्टैंड अ रैक"
      },
      {
        "start_time": 4080,
        "end_time": 7919,
        "duration": 3839,
        "text": "व्हिच इज़ रिट्रीवल ऑर्गमेंटेड जनरेशन। नाउ"
      },
      {
        "start_time": 6560,
        "end_time": 9840,
        "duration": 3280,
        "text": "इट साउंड्स कॉम्प्लिकेटेड बट इट्स"
      },
      {
        "start_time": 7919,
        "end_time": 11840,
        "duration": 3921,
        "text": "एक्चुअली अ वेरी सिंपल कॉन्सेप्ट ऑफ़ एआई।"
      },
      {
        "start_time": 9840,
        "end_time": 12800,
        "duration": 2960,
        "text": "रैग्स आज की डेट में बहुत ज्यादा पॉपुलर"
      },
      {
        "start_time": 11840,
        "end_time": 13759,
        "duration": 1919,
        "text": "हैं। बिकॉज़ दे आर वन ऑन ऑन ऑन ऑन ऑन ऑन ऑन"
      },
      {
        "start_time": 12800,
        "end_time": 15759,
        "duration": 2959,
        "text": "ऑन ऑन ऑफ़ द मोस्ट प्रैक्टिकल"
      },
      {
        "start_time": 13759,
        "end_time": 17600,
        "duration": 3841,
        "text": "एप्लीकेशनेशंस ऑफ़ एआई इन द रियल वर्ल्ड।"
      },
      {
        "start_time": 15759,
        "end_time": 19039,
        "duration": 3280,
        "text": "ऑलमोस्ट हर एक डोमेन के अंदर हमें रैग के"
      },
      {
        "start_time": 17600,
        "end_time": 21760,
        "duration": 4160,
        "text": "एप्लीकेशनेशंस देखने को मिलते हैं। वेदर"
      },
      {
        "start_time": 19039,
        "end_time": 24640,
        "duration": 5601,
        "text": "इट बी कस्टमर सपोर्ट, मेडिकल, लीगल,"
      },
      {
        "start_time": 21760,
        "end_time": 26400,
        "duration": 4640,
        "text": "फाइनेंस, कंप्लायंस और रिसर्च। इनफैक्ट इफ"
      },
      {
        "start_time": 24640,
        "end_time": 28160,
        "duration": 3520,
        "text": "आई शेयर अ पर्सनल एक्सपीरियंस, रिसेंटली"
      },
      {
        "start_time": 26400,
        "end_time": 30240,
        "duration": 3840,
        "text": "आई गॉट माय ब्लड टेस्ट डन। एंड जिस"
      },
      {
        "start_time": 28160,
        "end_time": 32719,
        "duration": 4559,
        "text": "एप्लीकेशन के ऊपर पूरी ब्लड रिपोर्ट आती"
      },
      {
        "start_time": 30240,
        "end_time": 34800,
        "duration": 4560,
        "text": "है, वहां पर आई गॉट एन एआई जनरेटेड समरी"
      },
      {
        "start_time": 32719,
        "end_time": 37200,
        "duration": 4481,
        "text": "फॉर माय रिपोर्ट अलोंग विद एफएक्यू"
      },
      {
        "start_time": 34800,
        "end_time": 39840,
        "duration": 5040,
        "text": "स्पेसिफिक टू माय पर्सनल डेटा एंड उसके"
      },
      {
        "start_time": 37200,
        "end_time": 42160,
        "duration": 4960,
        "text": "साथ में सम पर्सनल सजेशंस। नाउ दिस इज अ"
      },
      {
        "start_time": 39840,
        "end_time": 43840,
        "duration": 4000,
        "text": "कैपेबिलिटी जो नॉर्मल सिस्टम्स के पास"
      },
      {
        "start_time": 42160,
        "end_time": 46079,
        "duration": 3919,
        "text": "जैसे चार्जर जीपीडी हो गया, जेमिनाई हो"
      },
      {
        "start_time": 43840,
        "end_time": 48480,
        "duration": 4640,
        "text": "गया उनके पास नहीं होती बिकॉज़ दे डोंट हैव"
      },
      {
        "start_time": 46079,
        "end_time": 50800,
        "duration": 4721,
        "text": "एक्सेस टू दिस पर्टिकुलर डेटा। बट दिस इज़"
      },
      {
        "start_time": 48480,
        "end_time": 52719,
        "duration": 4239,
        "text": "अ कैपेबिलिटी जो बहुत सारी एंटरप्राइज"
      },
      {
        "start_time": 50800,
        "end_time": 55520,
        "duration": 4720,
        "text": "लेवल एप्लीकेशंस के पास आज की डेट में आ"
      },
      {
        "start_time": 52719,
        "end_time": 57520,
        "duration": 4801,
        "text": "रही है बिकॉज़ ऑफ़ रैक्स। तो उसी को आज के"
      },
      {
        "start_time": 55520,
        "end_time": 59440,
        "duration": 3920,
        "text": "सेशन के अंदर हम इन डेप्थ समझने वाले हैं।"
      },
      {
        "start_time": 57520,
        "end_time": 61520,
        "duration": 4000,
        "text": "सो वी विल कवर व्हाट एक्जेक्टली आर रैग्स?"
      },
      {
        "start_time": 59440,
        "end_time": 63680,
        "duration": 4240,
        "text": "व्हाई आर दे सो पॉपुलर। वी विल टॉक अबाउट"
      },
      {
        "start_time": 61520,
        "end_time": 65439,
        "duration": 3919,
        "text": "दी एंटायर रैग पाइपलाइन एंड उसके साथ में"
      },
      {
        "start_time": 63680,
        "end_time": 67439,
        "duration": 3759,
        "text": "वी विल डिस्कस सम ऑफ़ द मोस्ट पॉपुलर रैग"
      },
      {
        "start_time": 65439,
        "end_time": 69280,
        "duration": 3841,
        "text": "आर्किटेक्चर एंड यूज़ केसेस व्हिच आर"
      },
      {
        "start_time": 67439,
        "end_time": 71360,
        "duration": 3921,
        "text": "एक्चुअली बीइंग यूज़्ड इन द इंडस्ट्री। नाउ"
      },
      {
        "start_time": 69280,
        "end_time": 73360,
        "duration": 4080,
        "text": "टू अंडरस्टैंड रैग, लेट्स टेक टू केसेस।"
      },
      {
        "start_time": 71360,
        "end_time": 75439,
        "duration": 4079,
        "text": "केस वन है हमारे स्टूडेंट वन का जिसका कल"
      },
      {
        "start_time": 73360,
        "end_time": 77040,
        "duration": 3680,
        "text": "एक एग्जाम है। तो आज उनके पास बहुत सारी"
      },
      {
        "start_time": 75439,
        "end_time": 78880,
        "duration": 3441,
        "text": "बुक्स हैं। द स्टूडेंट्स गोइंग टू लर्न अ"
      },
      {
        "start_time": 77040,
        "end_time": 80080,
        "duration": 3040,
        "text": "लॉट, दे आर गोइंग टू मेमोराइज़ अ लॉट। एंड"
      },
      {
        "start_time": 78880,
        "end_time": 81759,
        "duration": 2879,
        "text": "डिपेंडिंग ऑन देयर लर्निंग्स एंड"
      },
      {
        "start_time": 80080,
        "end_time": 83280,
        "duration": 3200,
        "text": "मेमोराइजेशनंस। कल एग्जाम में जो भी"
      },
      {
        "start_time": 81759,
        "end_time": 86400,
        "duration": 4641,
        "text": "क्वेश्चंस आएंगे उसको ये स्टूडेंट आंसर"
      },
      {
        "start_time": 83280,
        "end_time": 88720,
        "duration": 5440,
        "text": "करके आएगा। दिस इज हाउ आर नॉर्मल एलएलएम्स"
      },
      {
        "start_time": 86400,
        "end_time": 90320,
        "duration": 3920,
        "text": "लाइक जीपीटी, जेमिनाई एंड क्लॉड वर्क्स।"
      },
      {
        "start_time": 88720,
        "end_time": 92000,
        "duration": 3280,
        "text": "बेसिकली जो भी हमारे एलएलएम्स होते हैं,"
      },
      {
        "start_time": 90320,
        "end_time": 94640,
        "duration": 4320,
        "text": "जो भी हमारे नॉर्मल मॉडल्स होते हैं, दे"
      },
      {
        "start_time": 92000,
        "end_time": 96560,
        "duration": 4560,
        "text": "आर ट्रेंड ऑन लार्ज डेटा सेट्स। एंड उसके"
      },
      {
        "start_time": 94640,
        "end_time": 98560,
        "duration": 3920,
        "text": "बाद एक बार ट्रेनिंग हो जाती है मॉडल की,"
      },
      {
        "start_time": 96560,
        "end_time": 100640,
        "duration": 4080,
        "text": "तो कोई भी यूजर जब कोई नई क्वेरी को"
      },
      {
        "start_time": 98560,
        "end_time": 102400,
        "duration": 3840,
        "text": "क्रिएट करेगा, सो दिस एलएलएम बेस्ड ऑन"
      },
      {
        "start_time": 100640,
        "end_time": 104880,
        "duration": 4240,
        "text": "देयर ट्रेनिंग, दे आर गोइंग टू प्रोड्यूस"
      },
      {
        "start_time": 102400,
        "end_time": 107360,
        "duration": 4960,
        "text": "और दे आर गोइंग टू जनरेट सम आंसर और जनरेट"
      },
      {
        "start_time": 104880,
        "end_time": 110240,
        "duration": 5360,
        "text": "सम कंटेंट। एंड यहां से हमारे पास कीवर्ड"
      },
      {
        "start_time": 107360,
        "end_time": 111759,
        "duration": 4399,
        "text": "आता है जनरेशन। नाउ लेट्स टेक केस टू। केस"
      },
      {
        "start_time": 110240,
        "end_time": 113759,
        "duration": 3519,
        "text": "टू के अंदर हमारे पास स्टूडेंट टू है"
      },
      {
        "start_time": 111759,
        "end_time": 115360,
        "duration": 3601,
        "text": "जिसका भी कल एग्जाम है। इस स्टूडेंट के"
      },
      {
        "start_time": 113759,
        "end_time": 117520,
        "duration": 3761,
        "text": "पास भी बहुत सारी बुक्स हैं जिससे ये"
      },
      {
        "start_time": 115360,
        "end_time": 119200,
        "duration": 3840,
        "text": "स्टूडेंट लर्न करेगा, मेमोराइज करेगा। पर"
      },
      {
        "start_time": 117520,
        "end_time": 121040,
        "duration": 3520,
        "text": "कल जब इस स्टूडेंट का एग्जाम होगा इट्स"
      },
      {
        "start_time": 119200,
        "end_time": 123119,
        "duration": 3919,
        "text": "गोइंग टू बी एन ओपन बुक एग्जाम। मतलब"
      },
      {
        "start_time": 121040,
        "end_time": 125280,
        "duration": 4240,
        "text": "स्टूडेंट को अलाउड होगा दैट दे कैन एक्सेस"
      },
      {
        "start_time": 123119,
        "end_time": 127200,
        "duration": 4081,
        "text": "द बुक। दे कैन वेरीफाई फैक्ट्स। दे कैन"
      },
      {
        "start_time": 125280,
        "end_time": 129360,
        "duration": 4080,
        "text": "वेरीफाई इनफार्मेशन इन रियल टाइम। दे कैन"
      },
      {
        "start_time": 127200,
        "end_time": 131520,
        "duration": 4320,
        "text": "लुक फॉर अप टू डेट इनफार्मेशन इन द बुक।"
      },
      {
        "start_time": 129360,
        "end_time": 134319,
        "duration": 4959,
        "text": "तो हाई चांसेस ये है कि स्टूडेंट टू"
      },
      {
        "start_time": 131520,
        "end_time": 137040,
        "duration": 5520,
        "text": "एग्जाम के अंदर बेटर परफॉर्म करेगा बिकॉज़"
      },
      {
        "start_time": 134319,
        "end_time": 139520,
        "duration": 5201,
        "text": "दे आर एबल टू लुक अप इनफार्मेशन इन द रियल"
      },
      {
        "start_time": 137040,
        "end_time": 141200,
        "duration": 4160,
        "text": "टाइम। एंड दिस इज एक्जेक्टली हाउ रैग"
      },
      {
        "start_time": 139520,
        "end_time": 143360,
        "duration": 3840,
        "text": "वर्क्स। तो रैग इज नॉट अ सिंगल"
      },
      {
        "start_time": 141200,
        "end_time": 145840,
        "duration": 4640,
        "text": "टेक्नोलॉजी। रैग इज बेसिकली अ टेक्निक"
      },
      {
        "start_time": 143360,
        "end_time": 147920,
        "duration": 4560,
        "text": "जिसको हम यूज करते हैं अपने मॉडल्स के जो"
      },
      {
        "start_time": 145840,
        "end_time": 150480,
        "duration": 4640,
        "text": "भी आंसर्स वो जनरेट करते हैं उसकी"
      },
      {
        "start_time": 147920,
        "end_time": 152720,
        "duration": 4800,
        "text": "एक्यूरेसी को उसकी क्वालिटी को इंप्रूव"
      },
      {
        "start_time": 150480,
        "end_time": 154959,
        "duration": 4479,
        "text": "करने के लिए। एंड हाउ डस इट वर्क? बेसिकली"
      },
      {
        "start_time": 152720,
        "end_time": 157599,
        "duration": 4879,
        "text": "रैक्स के अंदर वी अलाउ आवर एलएलएम। वी"
      },
      {
        "start_time": 154959,
        "end_time": 159760,
        "duration": 4801,
        "text": "अलाउ आवर मॉडल टू एक्सेस अ रियल टाइम एंड"
      },
      {
        "start_time": 157599,
        "end_time": 162080,
        "duration": 4481,
        "text": "अप टू डेट डेटाबेस। जिसके अंदर कोई"
      },
      {
        "start_time": 159760,
        "end_time": 164160,
        "duration": 4400,
        "text": "रेलेवेंट डेटा स्ट होता है जिसको हमारा"
      },
      {
        "start_time": 162080,
        "end_time": 166400,
        "duration": 4320,
        "text": "मॉडल रियल टाइम के अंदर एक्सेस कर पाएगा"
      },
      {
        "start_time": 164160,
        "end_time": 169120,
        "duration": 4960,
        "text": "एंड उसके बेसिस पर कुछ रेलेवेंट आंसर्स को"
      },
      {
        "start_time": 166400,
        "end_time": 170959,
        "duration": 4559,
        "text": "जनरेट कर पाएगा। तो नेचुरली दीज़ आंसर्स दे"
      },
      {
        "start_time": 169120,
        "end_time": 173120,
        "duration": 4000,
        "text": "आर गोइंग टू बी मोर एक्यूरेट, दे आर गोइंग"
      },
      {
        "start_time": 170959,
        "end_time": 175120,
        "duration": 4161,
        "text": "टू बी मोर अप टू डेट एंड दे आर आल्सो"
      },
      {
        "start_time": 173120,
        "end_time": 176640,
        "duration": 3520,
        "text": "गोइंग टू बी मोर कॉन्टेक्स्ट अवेयर।"
      },
      {
        "start_time": 175120,
        "end_time": 178400,
        "duration": 3280,
        "text": "कॉन्टेक्स्ट अवेयर का यहां पर क्या मतलब"
      },
      {
        "start_time": 176640,
        "end_time": 180400,
        "duration": 3760,
        "text": "है? जैसे लेट्स सपोज वी बुक द फ्लाइट एंड"
      },
      {
        "start_time": 178400,
        "end_time": 182159,
        "duration": 3759,
        "text": "इट गॉट डिलेड। तो हम नॉर्मल किसी भी चार्ज"
      },
      {
        "start_time": 180400,
        "end_time": 184080,
        "duration": 3680,
        "text": "जीपीडी या जेमिनाई जैसे टूल के पास जाएंगे"
      },
      {
        "start_time": 182159,
        "end_time": 186319,
        "duration": 4160,
        "text": "और सीधा पूछेंगे व्हाई इज माय फ्लाइट"
      },
      {
        "start_time": 184080,
        "end_time": 188239,
        "duration": 4159,
        "text": "डिलेड? तो इन टूल्स के पास एक्सेस नहीं है"
      },
      {
        "start_time": 186319,
        "end_time": 190159,
        "duration": 3840,
        "text": "कि हमने कौन सी फ्लाइट को बुक किया था? हु"
      },
      {
        "start_time": 188239,
        "end_time": 191680,
        "duration": 3441,
        "text": "एक्सैक्टली आर वी वो फ्लाइट एक्सक्टली"
      },
      {
        "start_time": 190159,
        "end_time": 194239,
        "duration": 4080,
        "text": "डिलेड क्यों है? क्या है उस फ्लाइट का"
      },
      {
        "start_time": 191680,
        "end_time": 196000,
        "duration": 4320,
        "text": "स्टेटस? बट जिस एयरलाइन से या जिस वेबसाइट"
      },
      {
        "start_time": 194239,
        "end_time": 198159,
        "duration": 3920,
        "text": "से हमने उस फ्लाइट को बुक किया होगा वहां"
      },
      {
        "start_time": 196000,
        "end_time": 200239,
        "duration": 4239,
        "text": "पर इफ देयर इज़ अ रैक बेस्ड कस्टमर सपोर्ट"
      },
      {
        "start_time": 198159,
        "end_time": 202000,
        "duration": 3841,
        "text": "चैटबॉट एंड उससे डायरेक्टली जाकर हम"
      },
      {
        "start_time": 200239,
        "end_time": 203840,
        "duration": 3601,
        "text": "पूछेंगे व्हाई इज माय फ्लाइट डिलेड एंड इफ"
      },
      {
        "start_time": 202000,
        "end_time": 205760,
        "duration": 3760,
        "text": "वी आर लॉक्ड इन तो वो जो एजेंट है उसके"
      },
      {
        "start_time": 203840,
        "end_time": 208000,
        "duration": 4160,
        "text": "पास ऑलरेडी रेलेवेंट इनफार्मेशन होगी कि"
      },
      {
        "start_time": 205760,
        "end_time": 209680,
        "duration": 3920,
        "text": "हम एक्जेक्टली कौन है? हमने कौन सी फ्लाइट"
      },
      {
        "start_time": 208000,
        "end_time": 212720,
        "duration": 4720,
        "text": "उस वेबसाइट से बुक की थी? उस फ्लाइट का"
      },
      {
        "start_time": 209680,
        "end_time": 214879,
        "duration": 5199,
        "text": "अराइवल टाइम, डेस्टिनेशन एंड पीएनआर सारी"
      },
      {
        "start_time": 212720,
        "end_time": 217440,
        "duration": 4720,
        "text": "इनफार्मेशन ऑलरेडी हमारे एजेंट के पास"
      },
      {
        "start_time": 214879,
        "end_time": 219519,
        "duration": 4640,
        "text": "होगी। एंड दिस एजेंट विल बी एबल टू गिव अस"
      },
      {
        "start_time": 217440,
        "end_time": 221440,
        "duration": 4000,
        "text": "मोर स्पेसिफिक आंसर। जबकि नॉर्मल टूल्स"
      },
      {
        "start_time": 219519,
        "end_time": 224319,
        "duration": 4800,
        "text": "हमें एक जेनेरिक सा रिस्पांस जनरेट करके"
      },
      {
        "start_time": 221440,
        "end_time": 226640,
        "duration": 5200,
        "text": "देते हैं। एंड दिस इज व्हाई रैग्स आर सो"
      },
      {
        "start_time": 224319,
        "end_time": 228319,
        "duration": 4000,
        "text": "पॉपुलर। तो रैग्स इसीलिए बहुत ज्यादा"
      },
      {
        "start_time": 226640,
        "end_time": 230080,
        "duration": 3440,
        "text": "यूज़फुल है इंडस्ट्री के अंदर बिकॉज़"
      },
      {
        "start_time": 228319,
        "end_time": 231680,
        "duration": 3361,
        "text": "एलएलएम्स के अंदर नेचुरली कुछ"
      },
      {
        "start_time": 230080,
        "end_time": 234080,
        "duration": 4000,
        "text": "शॉर्टकमिंग्स होती हैं। कुछ उनके वीक"
      },
      {
        "start_time": 231680,
        "end_time": 235920,
        "duration": 4240,
        "text": "पार्ट्स होते हैं जिसको रैक की हेल्प से"
      },
      {
        "start_time": 234080,
        "end_time": 237519,
        "duration": 3439,
        "text": "हम ओवरकम करने की कोशिश करते हैं। तो"
      },
      {
        "start_time": 235920,
        "end_time": 239680,
        "duration": 3760,
        "text": "रैक्स के बहुत सारे बेनिफिट्स हैं। फर्स्ट"
      },
      {
        "start_time": 237519,
        "end_time": 241920,
        "duration": 4401,
        "text": "ऑफ़ ऑल दे रिड्यूस हेलुसिनेशन। जितने भी"
      },
      {
        "start_time": 239680,
        "end_time": 243680,
        "duration": 4000,
        "text": "हमारे एलएलएम्स होते हैं समटाइम्स दे बिकम"
      },
      {
        "start_time": 241920,
        "end_time": 245680,
        "duration": 3760,
        "text": "ओवर कॉन्फिडेंट एंड जब उन्हें फैक्ट्स या"
      },
      {
        "start_time": 243680,
        "end_time": 247760,
        "duration": 4080,
        "text": "फिर जब उन्हें कोई सही चीज नहीं पता होती"
      },
      {
        "start_time": 245680,
        "end_time": 249680,
        "duration": 4000,
        "text": "सो दे समटाइ्स मेक अप फैक्ट्स और दे"
      },
      {
        "start_time": 247760,
        "end_time": 251920,
        "duration": 4160,
        "text": "प्रोड्यूस फॉल्स इनफेशन व्हिच वी कॉल"
      },
      {
        "start_time": 249680,
        "end_time": 253760,
        "duration": 4080,
        "text": "हेलुसिनेशन। तो इसी चीज को मिटिगेट करने"
      },
      {
        "start_time": 251920,
        "end_time": 255680,
        "duration": 3760,
        "text": "के लिए हम रैग आर्किटेक्चर को यूज़ कर सकते"
      },
      {
        "start_time": 253760,
        "end_time": 257759,
        "duration": 3999,
        "text": "हैं। तो जब हम रैग्स को यूज़ करते हैं तो"
      },
      {
        "start_time": 255680,
        "end_time": 259919,
        "duration": 4239,
        "text": "हमारे मॉडल के जो भी रिस्पॉन्सेस होंगे दे"
      },
      {
        "start_time": 257759,
        "end_time": 262639,
        "duration": 4880,
        "text": "विल बी मोर ग्राउंडेड एंड दे विल बी बेस्ड"
      },
      {
        "start_time": 259919,
        "end_time": 264639,
        "duration": 4720,
        "text": "मोर ऑन रियल डेटा। सेकंड बेनिफिट रैग्स का"
      },
      {
        "start_time": 262639,
        "end_time": 266000,
        "duration": 3361,
        "text": "होता है दैट दे कीप नॉलेज अप टू डेट।"
      },
      {
        "start_time": 264639,
        "end_time": 267280,
        "duration": 2641,
        "text": "जितने भी हमारे एलएलएम्स होते हैं या"
      },
      {
        "start_time": 266000,
        "end_time": 269120,
        "duration": 3120,
        "text": "जितने भी हमारे मॉडल्स होते हैं उनका"
      },
      {
        "start_time": 267280,
        "end_time": 271040,
        "duration": 3760,
        "text": "जनरली कोई ना कोई नॉलेज कट ऑफ डेट होता"
      },
      {
        "start_time": 269120,
        "end_time": 273040,
        "duration": 3920,
        "text": "है। नॉलेज कट ऑफ डेट कहने का मतलब है कि"
      },
      {
        "start_time": 271040,
        "end_time": 274880,
        "duration": 3840,
        "text": "मॉडल को ट्रेन करने के लिए जिस ट्रेनिंग"
      },
      {
        "start_time": 273040,
        "end_time": 276880,
        "duration": 3840,
        "text": "डेटा को यूज़ किया गया है वो ट्रेनिंग डेटा"
      },
      {
        "start_time": 274880,
        "end_time": 279680,
        "duration": 4800,
        "text": "इस डेट तक का है। जैसे GBT5 के लिए द"
      },
      {
        "start_time": 276880,
        "end_time": 281600,
        "duration": 4720,
        "text": "नॉलेज कट ऑफ इज़ फॉर 30th सप्टेंबर 2024।"
      },
      {
        "start_time": 279680,
        "end_time": 283520,
        "duration": 3840,
        "text": "जिसका मतलब है हमारा जो मॉडल है उसे करंट"
      },
      {
        "start_time": 281600,
        "end_time": 285440,
        "duration": 3840,
        "text": "इवेंट्स के बारे में नहीं पता। तो ऐसे"
      },
      {
        "start_time": 283520,
        "end_time": 287360,
        "duration": 3840,
        "text": "केसेस में अगर हम मॉडल को करंट इवेंट्स के"
      },
      {
        "start_time": 285440,
        "end_time": 289680,
        "duration": 4240,
        "text": "बारे में एक्सेस देना चाहते हैं। सो दैट"
      },
      {
        "start_time": 287360,
        "end_time": 291520,
        "duration": 4160,
        "text": "वी कैन गिव विद द हेल्प ऑफ़ रैग्स। उसके"
      },
      {
        "start_time": 289680,
        "end_time": 294080,
        "duration": 4400,
        "text": "साथ में थर्ड बेनिफिट होता है दैट ड्रैग्स"
      },
      {
        "start_time": 291520,
        "end_time": 296639,
        "duration": 5119,
        "text": "आर कॉस्ट इफेक्टिव। जनरली अगर किसी भी"
      },
      {
        "start_time": 294080,
        "end_time": 298639,
        "duration": 4559,
        "text": "मॉडल को रैग से पहले अगर हमें कुछ नए डेटा"
      },
      {
        "start_time": 296639,
        "end_time": 300400,
        "duration": 3761,
        "text": "की एक्सेस देनी होती तो उसके लिए या तो"
      },
      {
        "start_time": 298639,
        "end_time": 302160,
        "duration": 3521,
        "text": "हमें मॉडल को ट्रेन करना पड़ता या फिर उसे"
      },
      {
        "start_time": 300400,
        "end_time": 304960,
        "duration": 4560,
        "text": "फाइन ट्यून करना पड़ता व्हिच इज अ वेरी"
      },
      {
        "start_time": 302160,
        "end_time": 307120,
        "duration": 4960,
        "text": "एक्सपेंसिव प्रोसेस। बट रैग्स की हेल्प से"
      },
      {
        "start_time": 304960,
        "end_time": 309600,
        "duration": 4640,
        "text": "हम ट्रेनिंग को हम फाइन ट्यूनिंग को अवॉइड"
      },
      {
        "start_time": 307120,
        "end_time": 311840,
        "duration": 4720,
        "text": "कर सकते हैं। एंड डायरेक्टली हम डेटा की"
      },
      {
        "start_time": 309600,
        "end_time": 313919,
        "duration": 4319,
        "text": "एक्सेस दे सकते हैं टू द मॉडल। फोर्थ इसका"
      },
      {
        "start_time": 311840,
        "end_time": 315919,
        "duration": 4079,
        "text": "बेनिफिट होता है दैट वी मेंटेन सम लेवल ऑफ़"
      },
      {
        "start_time": 313919,
        "end_time": 317759,
        "duration": 3840,
        "text": "डेटा प्राइवेसी। एंड दिस इज़ वेरी यूज़फुल"
      },
      {
        "start_time": 315919,
        "end_time": 319840,
        "duration": 3921,
        "text": "एस्पेशली फॉर एंटरप्राइज लेवल। अगर कोई"
      },
      {
        "start_time": 317759,
        "end_time": 322080,
        "duration": 4321,
        "text": "बड़े लेवल की कंपनी है तो वो नहीं चाहेंगे"
      },
      {
        "start_time": 319840,
        "end_time": 324400,
        "duration": 4560,
        "text": "कि वो अपने इंटरनल या अपने सेंसिटिव डेटा"
      },
      {
        "start_time": 322080,
        "end_time": 325919,
        "duration": 3839,
        "text": "की एक्सेस दें मॉडल को या उस डेटा को यूज"
      },
      {
        "start_time": 324400,
        "end_time": 328160,
        "duration": 3760,
        "text": "करें मॉडल को ट्रेन करने के लिए या उसे"
      },
      {
        "start_time": 325919,
        "end_time": 329919,
        "duration": 4000,
        "text": "फाइन ट्यून करने के लिए। तो ऐसे में कोई"
      },
      {
        "start_time": 328160,
        "end_time": 331600,
        "duration": 3440,
        "text": "भी एंटरप्राइज लेवल की कंपनी या इनफैक्ट"
      },
      {
        "start_time": 329919,
        "end_time": 333280,
        "duration": 3361,
        "text": "कोई भी ऑर्गेनाइजेशन अपने डेटा की जो"
      },
      {
        "start_time": 331600,
        "end_time": 335120,
        "duration": 3520,
        "text": "प्राइवेसी है उसको मेंटेन कर पाते हैं।"
      },
      {
        "start_time": 333280,
        "end_time": 337039,
        "duration": 3759,
        "text": "उन्हें ट्रेन नहीं करना पड़ता मॉडल को तो"
      },
      {
        "start_time": 335120,
        "end_time": 339199,
        "duration": 4079,
        "text": "डेटा की पूरी एक्सेस नहीं देनी पड़ती।"
      },
      {
        "start_time": 337039,
        "end_time": 340880,
        "duration": 3841,
        "text": "इनफैक्ट रैग आर्किटेक्चर जिस तरीके से"
      },
      {
        "start_time": 339199,
        "end_time": 343039,
        "duration": 3840,
        "text": "वर्क करता है। रैग की पाइपलाइन जिस तरीके"
      },
      {
        "start_time": 340880,
        "end_time": 345280,
        "duration": 4400,
        "text": "से वर्क करती है। हमारा जो मॉडल होता है"
      },
      {
        "start_time": 343039,
        "end_time": 347440,
        "duration": 4401,
        "text": "वो एक टाइम पर पूरे के पूरे डेटाबेस को"
      },
      {
        "start_time": 345280,
        "end_time": 349680,
        "duration": 4400,
        "text": "एक्सेस नहीं कर पाता। जो भी उसके पास"
      },
      {
        "start_time": 347440,
        "end_time": 351840,
        "duration": 4400,
        "text": "क्वेरी आती है उस क्वेरी से रिलेटेड"
      },
      {
        "start_time": 349680,
        "end_time": 353440,
        "duration": 3760,
        "text": "डेटाबेस के स्पेसिफिक पार्ट्स को ही हमारा"
      },
      {
        "start_time": 351840,
        "end_time": 355199,
        "duration": 3359,
        "text": "मॉडल एक्सेस करता है। एंड दैट इज हाउ"
      },
      {
        "start_time": 353440,
        "end_time": 356960,
        "duration": 3520,
        "text": "ऑर्गेनाइजेशनंस के अंदर हमारा सेंसिटिव"
      },
      {
        "start_time": 355199,
        "end_time": 358720,
        "duration": 3521,
        "text": "डेटा कंप्लीटली एक्सपोज नहीं होता। एंड"
      },
      {
        "start_time": 356960,
        "end_time": 360880,
        "duration": 3920,
        "text": "नाउ लेट्स अंडरस्टैंड हाउ डस रैग वर्क"
      },
      {
        "start_time": 358720,
        "end_time": 362960,
        "duration": 4240,
        "text": "व्हाट इज द कंप्लीट रैग पाइपलाइन। नाउ वी"
      },
      {
        "start_time": 360880,
        "end_time": 364560,
        "duration": 3680,
        "text": "ऑलरेडी नो हाउ अ नॉर्मल एलएलएम वर्क्स।"
      },
      {
        "start_time": 362960,
        "end_time": 366080,
        "duration": 3120,
        "text": "हमारे पास जो भी यूज़र्स होते हैं वो कुछ"
      },
      {
        "start_time": 364560,
        "end_time": 368560,
        "duration": 4000,
        "text": "क्वेरी करते हैं। उसके बेसिस पर हमारा"
      },
      {
        "start_time": 366080,
        "end_time": 370560,
        "duration": 4480,
        "text": "मॉडल इज़ गोइंग टू जनरेट सम रिस्पांस। नाउ"
      },
      {
        "start_time": 368560,
        "end_time": 372800,
        "duration": 4240,
        "text": "लेट्स टॉक अबाउट द रैग पाइपलाइन कि रैग"
      },
      {
        "start_time": 370560,
        "end_time": 374560,
        "duration": 4000,
        "text": "कैसे वर्क करता है? रैक पाइपलाइन के दो"
      },
      {
        "start_time": 372800,
        "end_time": 376639,
        "duration": 3839,
        "text": "मेन कॉम्पोनेंट्स होते हैं। फर्स्ट इज"
      },
      {
        "start_time": 374560,
        "end_time": 378880,
        "duration": 4320,
        "text": "कॉल्ड द इंजेशन पाइपलाइन। सेकंड इज कॉल्ड"
      },
      {
        "start_time": 376639,
        "end_time": 380880,
        "duration": 4241,
        "text": "द रिट्रीवल पाइपलाइन। नाउ दीज़ आर स्केरी"
      },
      {
        "start_time": 378880,
        "end_time": 383360,
        "duration": 4480,
        "text": "वर्ड्स बट द कॉनंसेप्ट इज़ एक्चुअली वेरी"
      },
      {
        "start_time": 380880,
        "end_time": 385280,
        "duration": 4400,
        "text": "सिंपल। सबसे पहले इंजेशन पाइपलाइन के बारे"
      },
      {
        "start_time": 383360,
        "end_time": 387440,
        "duration": 4080,
        "text": "में बात करते हैं। इंजेशन पाइपलाइन"
      },
      {
        "start_time": 385280,
        "end_time": 389280,
        "duration": 4000,
        "text": "बेसिकली मींस कि कैसे हम अपने स्टूडेंट के"
      },
      {
        "start_time": 387440,
        "end_time": 391199,
        "duration": 3759,
        "text": "लिए अपनी ओपन बुक को प्रिपेयर करने वाले"
      },
      {
        "start_time": 389280,
        "end_time": 393199,
        "duration": 3919,
        "text": "हैं। मतलब वो जो डेटा जिसकी एक्सेस हम"
      },
      {
        "start_time": 391199,
        "end_time": 395520,
        "duration": 4321,
        "text": "मॉडल को देंगे उसको कैसे प्रिपेयर करेंगे।"
      },
      {
        "start_time": 393199,
        "end_time": 397280,
        "duration": 4081,
        "text": "सबसे पहले वी गेट ऑल द डेटा। तो ये डेटा"
      },
      {
        "start_time": 395520,
        "end_time": 398800,
        "duration": 3280,
        "text": "कुछ भी हो सकता है। इट कुड बी पीडीएफ, इट"
      },
      {
        "start_time": 397280,
        "end_time": 400880,
        "duration": 3600,
        "text": "कुड बी सिंपल डॉक्यूमेंट्स, इट कुड बी"
      },
      {
        "start_time": 398800,
        "end_time": 403759,
        "duration": 4959,
        "text": "एक्सेल फाइल्स। इट कुड बी एन एंटायर"
      },
      {
        "start_time": 400880,
        "end_time": 406000,
        "duration": 5120,
        "text": "वेबसाइट और इट कुड बी द एंटायर कंपनीज़"
      },
      {
        "start_time": 403759,
        "end_time": 408080,
        "duration": 4321,
        "text": "इंटरनल डेटाबेस। तो जो भी हमारा डेटा सेट"
      },
      {
        "start_time": 406000,
        "end_time": 410479,
        "duration": 4479,
        "text": "है वहां से हम यूज़फुल डेटा को एक्सट्रैक्ट"
      },
      {
        "start_time": 408080,
        "end_time": 412960,
        "duration": 4880,
        "text": "करेंगे। एंड देन वी स्प्लिट दिस डेटा इंटू"
      },
      {
        "start_time": 410479,
        "end_time": 414720,
        "duration": 4241,
        "text": "चंक्स। तो हम पूरे डेटा को एक साथ प्रोसेस"
      },
      {
        "start_time": 412960,
        "end_time": 416639,
        "duration": 3679,
        "text": "नहीं करते। हम उसे स्मॉल पार्ट्स के अंदर"
      },
      {
        "start_time": 414720,
        "end_time": 418479,
        "duration": 3759,
        "text": "डिवाइड करते हैं जिनको हम चंक्स कहते हैं।"
      },
      {
        "start_time": 416639,
        "end_time": 421120,
        "duration": 4481,
        "text": "एक बार हमारे पास सारे के सारे चंक्स आ"
      },
      {
        "start_time": 418479,
        "end_time": 423199,
        "duration": 4720,
        "text": "गए। देन वी आर गोइंग टू कन्वर्ट दीज़ चंक्स"
      },
      {
        "start_time": 421120,
        "end_time": 425039,
        "duration": 3919,
        "text": "इंटू एंबेडिंग्स। एंबेडिंग्स क्या होती"
      },
      {
        "start_time": 423199,
        "end_time": 427120,
        "duration": 3921,
        "text": "है? बेसिकली जितने भी हमारे सिस्टम्स या"
      },
      {
        "start_time": 425039,
        "end_time": 428960,
        "duration": 3921,
        "text": "मॉडल्स होते हैं दे कैन नॉट प्रोसेस"
      },
      {
        "start_time": 427120,
        "end_time": 430720,
        "duration": 3600,
        "text": "टेक्स्ट। वो सिर्फ नंबर्स को प्रोसेस कर"
      },
      {
        "start_time": 428960,
        "end_time": 432160,
        "duration": 3200,
        "text": "सकते हैं। तो इसीलिए हमारा जितना भी"
      },
      {
        "start_time": 430720,
        "end_time": 434240,
        "duration": 3520,
        "text": "टेक्स्ट है उसे हमें नंबर्स के अंदर"
      },
      {
        "start_time": 432160,
        "end_time": 436319,
        "duration": 4159,
        "text": "कन्वर्ट करना पड़ेगा। एंड उस कन्वर्जन के"
      },
      {
        "start_time": 434240,
        "end_time": 437840,
        "duration": 3600,
        "text": "लिए वी यूज़ सम एंबेडिंग एपीआई और सम"
      },
      {
        "start_time": 436319,
        "end_time": 439360,
        "duration": 3041,
        "text": "एंबेडिंग मॉडल। तो बहुत सारे"
      },
      {
        "start_time": 437840,
        "end_time": 441199,
        "duration": 3359,
        "text": "डिफरेंट-डिफरेंट मॉडल्स हैं जो इंडस्ट्री"
      },
      {
        "start_time": 439360,
        "end_time": 443360,
        "duration": 4000,
        "text": "के अंदर अवेलेबल हैं। तो हम हर एक सेपरेट"
      },
      {
        "start_time": 441199,
        "end_time": 445039,
        "duration": 3840,
        "text": "चंक के लिए उसकी सेपरेट एंबेडिंग को"
      },
      {
        "start_time": 443360,
        "end_time": 446479,
        "duration": 3119,
        "text": "क्रिएट करते हैं। एंबेडिंग को हम टेक्निकल"
      },
      {
        "start_time": 445039,
        "end_time": 448639,
        "duration": 3600,
        "text": "टर्म्स में वेक्टर एंबेडिंग भी कह सकते"
      },
      {
        "start_time": 446479,
        "end_time": 450960,
        "duration": 4481,
        "text": "हैं। बिकॉज़ दिस विल बेसिकली बी अ वेक्टर"
      },
      {
        "start_time": 448639,
        "end_time": 453120,
        "duration": 4481,
        "text": "ऑफ नंबर्स जो हमारे हर एक चंक को"
      },
      {
        "start_time": 450960,
        "end_time": 454960,
        "duration": 4000,
        "text": "रिप्रेजेंट करते हैं। जैसे ही हमारे पास"
      },
      {
        "start_time": 453120,
        "end_time": 457280,
        "duration": 4160,
        "text": "सारी की सारी एंबेडिंग्स आ गई। अब नेक्स्ट"
      },
      {
        "start_time": 454960,
        "end_time": 459840,
        "duration": 4880,
        "text": "स्टेप होगा टू स्टोर देम इन अ वेक्टर"
      },
      {
        "start_time": 457280,
        "end_time": 461840,
        "duration": 4560,
        "text": "डेटाबेस। वेक्टर डेटाबेस इज़ डिफरेंट फ्रॉम"
      },
      {
        "start_time": 459840,
        "end_time": 463280,
        "duration": 3440,
        "text": "अ नॉर्मल डेटाबेस। ये वेक्टर डेटाबेस का"
      },
      {
        "start_time": 461840,
        "end_time": 464960,
        "duration": 3120,
        "text": "नाम वेक्टर डेटाबेस इसलिए है क्योंकि ये"
      },
      {
        "start_time": 463280,
        "end_time": 467120,
        "duration": 3840,
        "text": "वेक्टर एंबेडिंग्स को स्टोर करता है। बट"
      },
      {
        "start_time": 464960,
        "end_time": 468960,
        "duration": 4000,
        "text": "दिस इज़ अ स्पेशल डेटाबेस। हमारे जितने भी"
      },
      {
        "start_time": 467120,
        "end_time": 471120,
        "duration": 4000,
        "text": "नॉर्मल डेटाबेस होते हैं जैसे मोंगो डीबी"
      },
      {
        "start_time": 468960,
        "end_time": 473199,
        "duration": 4239,
        "text": "हो गया, जैसे मायसक्यूएल हो गया। इन सारे"
      },
      {
        "start_time": 471120,
        "end_time": 475120,
        "duration": 4000,
        "text": "डेटाबेस के अंदर हम कीवर्ड सर्च कर सकते"
      },
      {
        "start_time": 473199,
        "end_time": 477360,
        "duration": 4161,
        "text": "हैं। कीवर्ड बेस सर्च कहने का मतलब है"
      },
      {
        "start_time": 475120,
        "end_time": 479440,
        "duration": 4320,
        "text": "लेट्स सपोज आई हैव सम मेडिकल रिकॉर्ड्स जो"
      },
      {
        "start_time": 477360,
        "end_time": 481759,
        "duration": 4399,
        "text": "मेरे डेटाबेस के अंदर स्टर्ड है। अगर मैं"
      },
      {
        "start_time": 479440,
        "end_time": 484479,
        "duration": 5039,
        "text": "उसके अंदर सर्च करना चाहती हूं हार्ट अटैक"
      },
      {
        "start_time": 481759,
        "end_time": 485919,
        "duration": 4160,
        "text": "सिम्टम्स तो मेरे डेटाबेस से वही"
      },
      {
        "start_time": 484479,
        "end_time": 487680,
        "duration": 3201,
        "text": "डॉक्यूमेंट्स आएंगे जिसके अंदर ये"
      },
      {
        "start_time": 485919,
        "end_time": 489919,
        "duration": 4000,
        "text": "कीवर्ड्स मेंशंड होंगे जिसके अंदर हार्ट"
      },
      {
        "start_time": 487680,
        "end_time": 491759,
        "duration": 4079,
        "text": "अटैक सिम्टम्स ये तीनों कीवर्ड्स मेंशंड"
      },
      {
        "start_time": 489919,
        "end_time": 493919,
        "duration": 4000,
        "text": "होंगे। वही डेटाबेस सर्च के अंदर आएंगे।"
      },
      {
        "start_time": 491759,
        "end_time": 495759,
        "duration": 4000,
        "text": "पर वेक्टर डेटाबेस स्पेशल इसलिए होते हैं"
      },
      {
        "start_time": 493919,
        "end_time": 497759,
        "duration": 3840,
        "text": "क्योंकि उसके अंदर हम सिंैटिक सर्च कर"
      },
      {
        "start_time": 495759,
        "end_time": 499919,
        "duration": 4160,
        "text": "सकते हैं। सिमेंटिक सर्च बेसिकली मींस"
      },
      {
        "start_time": 497759,
        "end_time": 501919,
        "duration": 4160,
        "text": "मीनिंग बेस्ड सर्च। जैसे लेट्स सपोज इन"
      },
      {
        "start_time": 499919,
        "end_time": 504240,
        "duration": 4321,
        "text": "माय वेक्टर डेटाबेस आई हैव सम डॉक्यूमेंट"
      },
      {
        "start_time": 501919,
        "end_time": 506479,
        "duration": 4560,
        "text": "रिलेटेड टू कार्डियक अरेस्ट। अब मैंने जो"
      },
      {
        "start_time": 504240,
        "end_time": 508800,
        "duration": 4560,
        "text": "सर्च किया हार्ट अटैक सिम्टम्स एंड"
      },
      {
        "start_time": 506479,
        "end_time": 511360,
        "duration": 4881,
        "text": "कार्डियक अरेस्ट। दोनों में कोई भी कीवर्ड"
      },
      {
        "start_time": 508800,
        "end_time": 513760,
        "duration": 4960,
        "text": "मैच नहीं करता। बट दोनों का मीनिंग सिमिलर"
      },
      {
        "start_time": 511360,
        "end_time": 516080,
        "duration": 4720,
        "text": "है। तो इसीलिए वेक्टर डेटाबेस रिजल्ट में"
      },
      {
        "start_time": 513760,
        "end_time": 518080,
        "duration": 4320,
        "text": "मुझे ये पर्टिकुलर डॉक्यूमेंट भी रिटर्न"
      },
      {
        "start_time": 516080,
        "end_time": 519839,
        "duration": 3759,
        "text": "करेगा जो एक नॉर्मल डेटाबेस रिटर्न नहीं"
      },
      {
        "start_time": 518080,
        "end_time": 521919,
        "duration": 3839,
        "text": "करता। सो, दिस इज़ हाउ वी क्रिएट आवर"
      },
      {
        "start_time": 519839,
        "end_time": 523360,
        "duration": 3521,
        "text": "वेक्टर डेटाबेस और आवर नॉलेज बेस जिसके"
      },
      {
        "start_time": 521919,
        "end_time": 525040,
        "duration": 3121,
        "text": "अंदर हम अपनी एंबेडिंग्स को स्टोर करते"
      },
      {
        "start_time": 523360,
        "end_time": 527920,
        "duration": 4560,
        "text": "हैं और डॉक्यूमेंट चंक्स को स्टोर करते"
      },
      {
        "start_time": 525040,
        "end_time": 530160,
        "duration": 5120,
        "text": "हैं। एंड दिस एंटायर पाइपलाइन और प्रोसेस"
      },
      {
        "start_time": 527920,
        "end_time": 532320,
        "duration": 4400,
        "text": "इज़ कॉल्ड द डेटा इंजेशन पाइपलाइन। [संगीत]"
      },
      {
        "start_time": 530160,
        "end_time": 535040,
        "duration": 4880,
        "text": "इसके बाद आती है हमारी सेकंड पाइपलाइन"
      },
      {
        "start_time": 532320,
        "end_time": 536959,
        "duration": 4639,
        "text": "व्हिच इज़ कॉल्ड द रिट्रीवल पाइपलाइन।"
      },
      {
        "start_time": 535040,
        "end_time": 539360,
        "duration": 4320,
        "text": "रिट्रीवल पाइपलाइन के अंदर क्या होता है?"
      },
      {
        "start_time": 536959,
        "end_time": 541200,
        "duration": 4241,
        "text": "दिस इज़ द फर्स्ट स्टेप। फर्स्ट स्टेप में"
      },
      {
        "start_time": 539360,
        "end_time": 543519,
        "duration": 4159,
        "text": "हमारा जो भी यूजर है वो नॉर्मली कोई"
      },
      {
        "start_time": 541200,
        "end_time": 545279,
        "duration": 4079,
        "text": "क्वेरी क्रिएट करेगा। अब इस क्वेरी को भी"
      },
      {
        "start_time": 543519,
        "end_time": 547680,
        "duration": 4161,
        "text": "हमें एंबेडिंग्स के अंदर क्रिएट करना"
      },
      {
        "start_time": 545279,
        "end_time": 549839,
        "duration": 4560,
        "text": "पड़ेगा। तो उसके लिए जो इंजेशन के टाइम पर"
      },
      {
        "start_time": 547680,
        "end_time": 551600,
        "duration": 3920,
        "text": "हमने एंबेडिंग एपीआई यूज़ की थी उसी को हम"
      },
      {
        "start_time": 549839,
        "end_time": 553519,
        "duration": 3680,
        "text": "यहां पर यूज़ करेंगे। एंड वी विल क्रिएट द"
      },
      {
        "start_time": 551600,
        "end_time": 555680,
        "duration": 4080,
        "text": "एंबेडिंग। एक बार हमारा फर्स्ट स्टेप"
      },
      {
        "start_time": 553519,
        "end_time": 557519,
        "duration": 4000,
        "text": "कंप्लीट हो गया। उसके बाद कम्स द सेकंड"
      },
      {
        "start_time": 555680,
        "end_time": 559600,
        "duration": 3920,
        "text": "स्टेप व्हिच इज़ कॉल्ड द रिट्रीवल [संगीत]"
      },
      {
        "start_time": 557519,
        "end_time": 562160,
        "duration": 4641,
        "text": "स्टेप। रिट्रीवल स्टेप के अंदर क्या होता"
      },
      {
        "start_time": 559600,
        "end_time": 564800,
        "duration": 5200,
        "text": "है? बेस्ड ऑन द क्वेरी एंबेडिंग। हम"
      },
      {
        "start_time": 562160,
        "end_time": 567120,
        "duration": 4960,
        "text": "क्वेरी से मैच करते हुए डॉक्यूमेंट्स को"
      },
      {
        "start_time": 564800,
        "end_time": 569519,
        "duration": 4719,
        "text": "अपने वेक्टर डेटाबेस के अंदर सर्च करेंगे।"
      },
      {
        "start_time": 567120,
        "end_time": 571519,
        "duration": 4399,
        "text": "सो इफ द क्वेरी इज़ रिलेटेड टू हार्ट अटैक"
      },
      {
        "start_time": 569519,
        "end_time": 573519,
        "duration": 4000,
        "text": "सिम्टम्स, वी आर गोइंग टू एक्सट्रैक्ट"
      },
      {
        "start_time": 571519,
        "end_time": 575440,
        "duration": 3921,
        "text": "कार्डियक अरेस्ट या सिमिलर डॉक्यूमेंट्स"
      },
      {
        "start_time": 573519,
        "end_time": 577120,
        "duration": 3601,
        "text": "फ्रॉम द वेक्टर डेटाबेस। तो जितने भी"
      },
      {
        "start_time": 575440,
        "end_time": 579279,
        "duration": 3839,
        "text": "हमारे डॉक्यूमेंट्स एक्सट्रैक्ट होंगे"
      },
      {
        "start_time": 577120,
        "end_time": 581120,
        "duration": 4000,
        "text": "उसके लिए हम सिमेंटिक सर्च या सिमिलरिटी"
      },
      {
        "start_time": 579279,
        "end_time": 583279,
        "duration": 4000,
        "text": "सर्च को यूज करते हैं। वो सारे के सारे"
      },
      {
        "start_time": 581120,
        "end_time": 585360,
        "duration": 4240,
        "text": "रैंक्ड डॉक्यूमेंट्स हमारे पास आ जाएंगे।"
      },
      {
        "start_time": 583279,
        "end_time": 588000,
        "duration": 4721,
        "text": "तो डेटाबेस से हमने क्या किया? कुछ"
      },
      {
        "start_time": 585360,
        "end_time": 589760,
        "duration": 4400,
        "text": "पर्टिकुलर रेलेवेंट इनफेशन को एक्सट्रैक्ट"
      },
      {
        "start_time": 588000,
        "end_time": 591920,
        "duration": 3920,
        "text": "कर लिया। एंड ये जो एक्सट्रैक्टेड"
      },
      {
        "start_time": 589760,
        "end_time": 593600,
        "duration": 3840,
        "text": "इनफार्मेशन है इसको हम कहते हैं अपना"
      },
      {
        "start_time": 591920,
        "end_time": 596000,
        "duration": 4080,
        "text": "कॉन्टेक्स्ट। [संगीत] अब ये जो"
      },
      {
        "start_time": 593600,
        "end_time": 598640,
        "duration": 5040,
        "text": "कॉन्टेक्स्ट है ये हम अपने मॉडल को पास"
      },
      {
        "start_time": 596000,
        "end_time": 601040,
        "duration": 5040,
        "text": "करेंगे। सो नाउ कम्स द थर्ड स्टेप व्हिच"
      },
      {
        "start_time": 598640,
        "end_time": 602959,
        "duration": 4319,
        "text": "इज़ कॉल्ड ऑगमेंटेशन। ऑगमेंटेशन का मतलब है"
      },
      {
        "start_time": 601040,
        "end_time": 605600,
        "duration": 4560,
        "text": "इंस्टेड ऑफ अ सिंपल क्वेरी वी आर गोइंग टू"
      },
      {
        "start_time": 602959,
        "end_time": 607440,
        "duration": 4481,
        "text": "पास एन एंटायर प्र्पों्ट टू द मॉडल। प्र्प"
      },
      {
        "start_time": 605600,
        "end_time": 609519,
        "duration": 3919,
        "text": "के अंदर दो पार्ट्स हैं। सबसे पहला हम"
      },
      {
        "start_time": 607440,
        "end_time": 611680,
        "duration": 4240,
        "text": "ओरिजिनल क्वेरी को रखेंगे। एंड उसके साथ"
      },
      {
        "start_time": 609519,
        "end_time": 613519,
        "duration": 4000,
        "text": "में वी आर गोइंग टू ऐड द कॉन्टेक्स्ट जो"
      },
      {
        "start_time": 611680,
        "end_time": 614959,
        "duration": 3279,
        "text": "अभी हमें मिला है। तो उससे हमारा एक"
      },
      {
        "start_time": 613519,
        "end_time": 617440,
        "duration": 3921,
        "text": "प्रम्प्ट क्रिएट होता है। मतलब"
      },
      {
        "start_time": 614959,
        "end_time": 619839,
        "duration": 4880,
        "text": "ऑर्गमेंटेशन होती है एंड देन वी पास इट टू"
      },
      {
        "start_time": 617440,
        "end_time": 622000,
        "duration": 4560,
        "text": "द एलएलएम। एंड उसके बाद हमारा फाइनल स्टेप"
      },
      {
        "start_time": 619839,
        "end_time": 624160,
        "duration": 4321,
        "text": "आता है व्हिच इज़ कॉल्ड जनरेशन। जिसका मतलब"
      },
      {
        "start_time": 622000,
        "end_time": 627200,
        "duration": 5200,
        "text": "है एलएलएम फाइनली किसी आंसर को जनरेट"
      },
      {
        "start_time": 624160,
        "end_time": 630000,
        "duration": 5840,
        "text": "करेगा एंड वी रिटर्न दिस आंसर टू द यूजर।"
      },
      {
        "start_time": 627200,
        "end_time": 632800,
        "duration": 5600,
        "text": "सो दिस इज व्हाई रैग्स आर कॉल्ड रिट्रीवल"
      },
      {
        "start_time": 630000,
        "end_time": 634480,
        "duration": 4480,
        "text": "ऑगमेंटेड जनरेशन। जनरेशन क्यों? क्योंकि"
      },
      {
        "start_time": 632800,
        "end_time": 636399,
        "duration": 3599,
        "text": "रैग्स किसी भी आंसर को, को रिस्पांस को,"
      },
      {
        "start_time": 634480,
        "end_time": 639120,
        "duration": 4640,
        "text": "कंटेंट को जनरेट करने का काम करते हैं।"
      },
      {
        "start_time": 636399,
        "end_time": 642160,
        "duration": 5761,
        "text": "एंड दिस जनरेशन इज़ नॉट सिंपल। दिस इज़"
      },
      {
        "start_time": 639120,
        "end_time": 644079,
        "duration": 4959,
        "text": "रिट्रीवल ऑर्गमेंटेड। मतलब पहले रिट्रीवल"
      },
      {
        "start_time": 642160,
        "end_time": 646240,
        "duration": 4080,
        "text": "होता है एंड उसके बाद हम अपनी ओरिजिनल"
      },
      {
        "start_time": 644079,
        "end_time": 648800,
        "duration": 4721,
        "text": "क्वेरी को ऑर्गुमेंट करते हैं। दैट इज़"
      },
      {
        "start_time": 646240,
        "end_time": 651120,
        "duration": 4880,
        "text": "व्हाई द जनरेशन इज़ रिट्रीवल ऑर्गमेंटेड"
      },
      {
        "start_time": 648800,
        "end_time": 652959,
        "duration": 4159,
        "text": "जनरेशन इन रैक्स। नाउ लेट्स टॉक अबाउट सम"
      },
      {
        "start_time": 651120,
        "end_time": 654399,
        "duration": 3279,
        "text": "ऑफ़ द टेक्निकल इंप्लीमेंटेशंस। नाउ थ्री"
      },
      {
        "start_time": 652959,
        "end_time": 656560,
        "duration": 3601,
        "text": "थिंग्स मैटर अ लॉट व्हेन वी इंप्लीमेंट"
      },
      {
        "start_time": 654399,
        "end_time": 658640,
        "duration": 4241,
        "text": "दिस पाइपलाइन। फर्स्ट बीइंग द चंकिंग"
      },
      {
        "start_time": 656560,
        "end_time": 660880,
        "duration": 4320,
        "text": "स्ट्रेटजी वी आर यूजिंग। सेकंड बीइंग द"
      },
      {
        "start_time": 658640,
        "end_time": 662880,
        "duration": 4240,
        "text": "एंबेडिंग मॉडल एंड थर्ड बीइंग द वेक्टर"
      },
      {
        "start_time": 660880,
        "end_time": 664880,
        "duration": 4000,
        "text": "डेटाबेस वी हैव। इफ वी टॉक अबाउट चंकिंग"
      },
      {
        "start_time": 662880,
        "end_time": 666720,
        "duration": 3840,
        "text": "स्ट्रेटजीस देयर आर अ लॉट ऑफ डिफरेंट"
      },
      {
        "start_time": 664880,
        "end_time": 669120,
        "duration": 4240,
        "text": "टाइप्स ऑफ चंकिंग। फर्स्ट इज़ कॉल्ड"
      },
      {
        "start_time": 666720,
        "end_time": 671440,
        "duration": 4720,
        "text": "फिक्स्ड साइज चंकिंग व्हेयर वी स्प्लिट द"
      },
      {
        "start_time": 669120,
        "end_time": 673279,
        "duration": 4159,
        "text": "टेक्स्ट इंटू फिक्स्ड साइज चंक्स। फॉर"
      },
      {
        "start_time": 671440,
        "end_time": 675600,
        "duration": 4160,
        "text": "एग्जांपल, वी आर क्रिएटिंग अ न्यू चंक"
      },
      {
        "start_time": 673279,
        "end_time": 677279,
        "duration": 4000,
        "text": "आफ्टर एव्री 500 टोकंस। सो दिस इज़ वैरी"
      },
      {
        "start_time": 675600,
        "end_time": 679519,
        "duration": 3919,
        "text": "सिंपल टू इंप्लीमेंट बट इट एक्चुअली हैज़ अ"
      },
      {
        "start_time": 677279,
        "end_time": 681600,
        "duration": 4321,
        "text": "लॉट ऑफ़ ड्रॉबैक्स। द मोस्ट पॉपुलर ड्रॉबैक"
      },
      {
        "start_time": 679519,
        "end_time": 683360,
        "duration": 3841,
        "text": "बीइंग दैट इट कैन ब्रेक आवर कॉनंटेक्स्ट"
      },
      {
        "start_time": 681600,
        "end_time": 685200,
        "duration": 3600,
        "text": "मिड सेंटेंस। नेक्स्ट इज़ हायरार्किकल"
      },
      {
        "start_time": 683360,
        "end_time": 687519,
        "duration": 4159,
        "text": "चंकिंग। व्हेयर वी क्रिएट आर चंक्स ऑन द"
      },
      {
        "start_time": 685200,
        "end_time": 689440,
        "duration": 4240,
        "text": "बेसिस ऑफ़ डिफरेंट सेक्शंस। ऑर वी क्रिएट"
      },
      {
        "start_time": 687519,
        "end_time": 691360,
        "duration": 3841,
        "text": "चंक्स फॉर एव्री पैराग्राफ। ऑर वी क्रिएट"
      },
      {
        "start_time": 689440,
        "end_time": 692640,
        "duration": 3200,
        "text": "चंक्स फॉर एव्री सेंटेंसेस। सो दिस इज़ मोर"
      },
      {
        "start_time": 691360,
        "end_time": 694480,
        "duration": 3120,
        "text": "कॉम्प्लेक्स टू इंप्लीमेंट बट इट्स"
      },
      {
        "start_time": 692640,
        "end_time": 697120,
        "duration": 4480,
        "text": "एक्चुअली वेरी पॉपुलर फॉर प्रोडक्शन लेवल"
      },
      {
        "start_time": 694480,
        "end_time": 699440,
        "duration": 4960,
        "text": "सिस्टम्स। थर्ड इज़ कॉल्ड सिमेंटिक चंकिंग।"
      },
      {
        "start_time": 697120,
        "end_time": 701600,
        "duration": 4480,
        "text": "सो इन सिमेंटिक चंकिंग वी क्रिएट चंक्स ऑन"
      },
      {
        "start_time": 699440,
        "end_time": 703680,
        "duration": 4240,
        "text": "द बेसिस ऑफ मीनिंग। सो वी कैन क्रिएट अ"
      },
      {
        "start_time": 701600,
        "end_time": 705279,
        "duration": 3679,
        "text": "न्यू चंक व्हेनएवर देअर इज़ अ न्यू टॉपिक"
      },
      {
        "start_time": 703680,
        "end_time": 707200,
        "duration": 3520,
        "text": "व्हिच इमरजज़ इन द डॉक्युमेंट्स। सो"
      },
      {
        "start_time": 705279,
        "end_time": 709200,
        "duration": 3921,
        "text": "सिमेंटिक चंकिंग इज़ एक्चुअली अ स्लोअर"
      },
      {
        "start_time": 707200,
        "end_time": 711360,
        "duration": 4160,
        "text": "प्रोसेस। बट इट प्रोड्यूसेस हाई क्वालिटी"
      },
      {
        "start_time": 709200,
        "end_time": 713600,
        "duration": 4400,
        "text": "चंक्स। सो देयर आर अ लॉट मोर चंकिंग"
      },
      {
        "start_time": 711360,
        "end_time": 715680,
        "duration": 4320,
        "text": "स्ट्रेटजीस दैट एक्सिस्ट एंड इफ वी वांट"
      },
      {
        "start_time": 713600,
        "end_time": 718320,
        "duration": 4720,
        "text": "टू इंप्लीमेंट चंकिंग सो वन ऑफ द मोस्ट"
      },
      {
        "start_time": 715680,
        "end_time": 719839,
        "duration": 4159,
        "text": "पॉपुलर लाइब्रेरीज इंक्लूड लैंगचेन लामा"
      },
      {
        "start_time": 718320,
        "end_time": 721279,
        "duration": 2959,
        "text": "इंडेक्स एंड हेस्टैक। सेकंडली फॉर"
      },
      {
        "start_time": 719839,
        "end_time": 723360,
        "duration": 3521,
        "text": "क्रिएटिंग एंबेडिंग्स वी हैव मल्टीपल"
      },
      {
        "start_time": 721279,
        "end_time": 725279,
        "duration": 4000,
        "text": "पॉपुलर एंबेडिंग मॉडल्स व्हिच इंक्लूड ओपन"
      },
      {
        "start_time": 723360,
        "end_time": 727519,
        "duration": 4159,
        "text": "एआईस टेक्स्ट एंबेडिंग्स थ्री। [संगीत] वी"
      },
      {
        "start_time": 725279,
        "end_time": 729519,
        "duration": 4240,
        "text": "हेव जेमिनाई एंबेडिंग्स। इन द हगिंग फेस"
      },
      {
        "start_time": 727519,
        "end_time": 731519,
        "duration": 4000,
        "text": "इकोसिस्टम वी आल्सो हेव सेंटेंस"
      },
      {
        "start_time": 729519,
        "end_time": 733600,
        "duration": 4081,
        "text": "ट्रांसफॉर्मर्स दैट वी कैन यू। इफ वी टॉक"
      },
      {
        "start_time": 731519,
        "end_time": 735839,
        "duration": 4320,
        "text": "अबाउट वेक्टर डेटा बेसेस, वी हैव अ लॉट ऑफ़"
      },
      {
        "start_time": 733600,
        "end_time": 737600,
        "duration": 4000,
        "text": "पॉपुलर ऑप्शंस। वी हैव क्रोमा डीबी, वी"
      },
      {
        "start_time": 735839,
        "end_time": 739680,
        "duration": 3841,
        "text": "हैव फाइस, वी हैव पाइन कोन, वी हैव"
      },
      {
        "start_time": 737600,
        "end_time": 741519,
        "duration": 3919,
        "text": "इलास्टिक सर्च एंड मेनी मोर वेक्टर"
      },
      {
        "start_time": 739680,
        "end_time": 743519,
        "duration": 3839,
        "text": "डेटाबेस व्हिच आर अवेलेबल टु अस। नेक्स्ट"
      },
      {
        "start_time": 741519,
        "end_time": 745839,
        "duration": 4320,
        "text": "लेट्स टॉक अबाउट सेवन ऑफ़ द मोस्ट रेलेवेंट"
      },
      {
        "start_time": 743519,
        "end_time": 748240,
        "duration": 4721,
        "text": "रैग आर्किटेक्चर्स एंड यूज़ केसेस इन दी"
      },
      {
        "start_time": 745839,
        "end_time": 750320,
        "duration": 4481,
        "text": "इंडस्ट्री। फर्स्ट इज़ द नाइव ऑर द"
      },
      {
        "start_time": 748240,
        "end_time": 752160,
        "duration": 3920,
        "text": "स्टैण्डर्ड रैग। इट इज़ द सेम आर्किटेक्चर"
      },
      {
        "start_time": 750320,
        "end_time": 754480,
        "duration": 4160,
        "text": "दैट वी हैव डिस्कस राइट नाउ। सो, इन दिस"
      },
      {
        "start_time": 752160,
        "end_time": 756639,
        "duration": 4479,
        "text": "आर्किटेक्चर, वी हैव अ यूजर क्वेरी कमिंग"
      },
      {
        "start_time": 754480,
        "end_time": 758720,
        "duration": 4240,
        "text": "इन। वी कन्वर्ट द क्वेरी इंटू एंबेडिंग्स"
      },
      {
        "start_time": 756639,
        "end_time": 760560,
        "duration": 3921,
        "text": "एंड देन वी रिट्रीव द टॉप चंक्स व्हिच"
      },
      {
        "start_time": 758720,
        "end_time": 762560,
        "duration": 3840,
        "text": "बिकम्स द कॉनंटेक्स्ट। वी ऐडेड टू द"
      },
      {
        "start_time": 760560,
        "end_time": 764320,
        "duration": 3760,
        "text": "प्रम्प्ट एंड देन द मॉडल जनरेट सम"
      },
      {
        "start_time": 762560,
        "end_time": 765760,
        "duration": 3200,
        "text": "रिस्पॉन्स फॉर अस। सो, दिस इज़ अ स्टैंडर्ड"
      },
      {
        "start_time": 764320,
        "end_time": 767040,
        "duration": 2720,
        "text": "प्रोसेस दैट हपेंस इन दिस टाइप ऑफ़"
      },
      {
        "start_time": 765760,
        "end_time": 769120,
        "duration": 3360,
        "text": "आर्किटेक्चर, इज़ एक्चुअली अ लो"
      },
      {
        "start_time": 767040,
        "end_time": 771680,
        "duration": 4640,
        "text": "कॉम्प्लेक्सिटी आर्किटेक्चर। सो, दिस इज़"
      },
      {
        "start_time": 769120,
        "end_time": 773680,
        "duration": 4560,
        "text": "हाइली सूटेबल फॉर क्रिएटिंग एफएक्यूस फॉर"
      },
      {
        "start_time": 771680,
        "end_time": 775680,
        "duration": 4000,
        "text": "एनी पर्टिकुलर वेबसाइट ऑर फॉर क्रिएटिंग"
      },
      {
        "start_time": 773680,
        "end_time": 777440,
        "duration": 3760,
        "text": "सिंपल सपोर्ट चैट बॉट्स विथ क्लीन"
      },
      {
        "start_time": 775680,
        "end_time": 779279,
        "duration": 3599,
        "text": "डॉक्यूमेंटेशन। सेकंड इज़ कॉल्ड अ हाइब्रिड"
      },
      {
        "start_time": 777440,
        "end_time": 781040,
        "duration": 3600,
        "text": "रैक। सो, इन अ स्टैंडर्ड रैक वी हैव अ"
      },
      {
        "start_time": 779279,
        "end_time": 783040,
        "duration": 3761,
        "text": "प्योर वेक्टर सर्च दैट हपेंस, व्हिच इज़"
      },
      {
        "start_time": 781040,
        "end_time": 785600,
        "duration": 4560,
        "text": "ग्रेट फॉर मीनिंग बट वीक फॉर एक्सैक्ट"
      },
      {
        "start_time": 783040,
        "end_time": 787040,
        "duration": 4000,
        "text": "मैचेस लाइक आईडीज़, लाइक नेम्स, ओर सम"
      },
      {
        "start_time": 785600,
        "end_time": 788880,
        "duration": 3280,
        "text": "इंडस्ट्री स्पेसिफिक टर्म्स। [संगीत] सो"
      },
      {
        "start_time": 787040,
        "end_time": 790800,
        "duration": 3760,
        "text": "व्हाट हाइब्रिड रैग डस इज़, इट कंबाइनस"
      },
      {
        "start_time": 788880,
        "end_time": 793360,
        "duration": 4480,
        "text": "वेक्टर सर्च एंड कीवर्ड सर्च टू गेट अ"
      },
      {
        "start_time": 790800,
        "end_time": 795760,
        "duration": 4960,
        "text": "बेस्ट ऑफ़ बोथ। सो हाइब्रिड रैग इज बेस्ट"
      },
      {
        "start_time": 793360,
        "end_time": 798160,
        "duration": 4800,
        "text": "फॉर एंटरप्राइज लेवल सर्च एंड इवन फॉर"
      },
      {
        "start_time": 795760,
        "end_time": 800160,
        "duration": 4400,
        "text": "ई-कॉमर्स सर्चेस। इनफैक्ट इन प्रोडक्शन"
      },
      {
        "start_time": 798160,
        "end_time": 802240,
        "duration": 4080,
        "text": "लेवल सिस्टम्स हाइब्रिड सर्च इज अ वैरी"
      },
      {
        "start_time": 800160,
        "end_time": 804320,
        "duration": 4160,
        "text": "कॉमन टाइप ऑफ रैग आर्किटेक्चर दैट वी गेट"
      },
      {
        "start_time": 802240,
        "end_time": 806560,
        "duration": 4320,
        "text": "टू सी। थर्ड इज़ कॉल्ड अ रैग विद मेमोरी।"
      },
      {
        "start_time": 804320,
        "end_time": 808800,
        "duration": 4480,
        "text": "सो अ स्टैंडर्ड रैग इट डस नॉट स्टोर पास्ट"
      },
      {
        "start_time": 806560,
        "end_time": 811120,
        "duration": 4560,
        "text": "कन्वर्सेशन। सो इफ अ यूजर आस्क कैन यू"
      },
      {
        "start_time": 808800,
        "end_time": 813040,
        "duration": 4240,
        "text": "एक्सप्लेन मोर अबाउट इट। द सिंपल ओर द"
      },
      {
        "start_time": 811120,
        "end_time": 814880,
        "duration": 3760,
        "text": "स्टैंडर्ड रैग विल नॉट अंडरस्टैंड ओवर"
      },
      {
        "start_time": 813040,
        "end_time": 816959,
        "duration": 3919,
        "text": "एक्साक्टली इज़ [संगीत] इट। सो द रैग नीड्स"
      },
      {
        "start_time": 814880,
        "end_time": 818959,
        "duration": 4079,
        "text": "टू मेटेन सम सॉर्ट ऑफ़ हिस्ट्री टू रिमेंबर"
      },
      {
        "start_time": 816959,
        "end_time": 821040,
        "duration": 4081,
        "text": "पास्ट कन्वर्सेशन्स एंड दैट इज व्हेयर रैग"
      },
      {
        "start_time": 818959,
        "end_time": 823440,
        "duration": 4481,
        "text": "विद मेमोरी कम्स इन। सो व्हाट इट डज इट?"
      },
      {
        "start_time": 821040,
        "end_time": 825519,
        "duration": 4479,
        "text": "इट क्रिएट्स अ सेपरेट मेमोरी लेयर ऑन टॉप"
      },
      {
        "start_time": 823440,
        "end_time": 827360,
        "duration": 3920,
        "text": "ऑफ दी एकज़िस्टिंग आर्किटेक्चर टु मेंटेन अ"
      },
      {
        "start_time": 825519,
        "end_time": 829120,
        "duration": 3601,
        "text": "रनिंग थ्रेड ऑफ़ द कन्वर्सेशन। एंड दिस"
      },
      {
        "start_time": 827360,
        "end_time": 831120,
        "duration": 3760,
        "text": "टाइप ऑफ़ रैग आर्किटेक्चर इज़ ग्रेट फॉर"
      },
      {
        "start_time": 829120,
        "end_time": 833040,
        "duration": 3920,
        "text": "क्रिएटिंग सपोर्ट असिस्टेंस एंड चैटबॉट्स।"
      },
      {
        "start_time": 831120,
        "end_time": 834800,
        "duration": 3680,
        "text": "फोर्थ इज़ द ग्राफ रैग। सो इन अ स्टैंडर्ड"
      },
      {
        "start_time": 833040,
        "end_time": 836880,
        "duration": 3840,
        "text": "रैग जितना भी डेटा होता है इट्स ट्रीटेड"
      },
      {
        "start_time": 834800,
        "end_time": 838800,
        "duration": 4000,
        "text": "अस इंडिपेंडेंट चंक्स। सो इट्स बिकम वेरी"
      },
      {
        "start_time": 836880,
        "end_time": 841440,
        "duration": 4560,
        "text": "डिफिकल्ट टू ट्रैक द रिलेशनशिप बिटवीन"
      },
      {
        "start_time": 838800,
        "end_time": 843920,
        "duration": 5120,
        "text": "एंटिटीज़। तो, ग्राफ रैग के अंदर व्हाट डु"
      },
      {
        "start_time": 841440,
        "end_time": 845440,
        "duration": 4000,
        "text": "वी डू, वी प्रिजर्व द रिलेशनशिप्स अमंग"
      },
      {
        "start_time": 843920,
        "end_time": 848320,
        "duration": 4400,
        "text": "डिफरेंट डॉक्युमेंट्स, अमंग डिफरेंट"
      },
      {
        "start_time": 845440,
        "end_time": 850240,
        "duration": 4800,
        "text": "चंक्स। बिकॉज़ वी स्ट्रक्चर आवर डेटा इन द"
      },
      {
        "start_time": 848320,
        "end_time": 852399,
        "duration": 4079,
        "text": "फॉर्म ऑफ अ नॉलेज ग्राफ ऑर इन द फॉर्म ऑफ"
      },
      {
        "start_time": 850240,
        "end_time": 853680,
        "duration": 3440,
        "text": "अ ग्राफ। तो इफ वी हैव ऑलरेडी लर्नड अबाउट"
      },
      {
        "start_time": 852399,
        "end_time": 855279,
        "duration": 2880,
        "text": "ग्राफ, डेटा स्ट्रक्चर एंड डेटा"
      },
      {
        "start_time": 853680,
        "end_time": 857279,
        "duration": 3599,
        "text": "स्ट्रक्चर्स एंड एल्गोरिदम्स। ओर इफ वी"
      },
      {
        "start_time": 855279,
        "end_time": 859279,
        "duration": 4000,
        "text": "हैव यूज़्ड डेटा बेसेस लाइक Neo 4J। सो"
      },
      {
        "start_time": 857279,
        "end_time": 861279,
        "duration": 4000,
        "text": "इट्स द सेम कॉन्सेप्ट हियर। तो यहां पर"
      },
      {
        "start_time": 859279,
        "end_time": 863120,
        "duration": 3841,
        "text": "बेसिकली हमारी जो डिफरेंट एंटिटीज़ होती"
      },
      {
        "start_time": 861279,
        "end_time": 865279,
        "duration": 4000,
        "text": "हैं डेटा के अंदर दे बिकम द नोड फॉर द"
      },
      {
        "start_time": 863120,
        "end_time": 867120,
        "duration": 4000,
        "text": "ग्राफ। एंड द एजेस ऑफ द ग्राफ दे"
      },
      {
        "start_time": 865279,
        "end_time": 868800,
        "duration": 3521,
        "text": "रिप्रेजेंट द रिलेशनशिप बिटवीन दीज़"
      },
      {
        "start_time": 867120,
        "end_time": 870480,
        "duration": 3360,
        "text": "एंटिटीज़। सो ग्राफ ट्रैक इज़ अ कॉम्प्लेक्स"
      },
      {
        "start_time": 868800,
        "end_time": 872240,
        "duration": 3440,
        "text": "आर्किटेक्चर बट इट्स सूटेबल फॉर फ्रॉड"
      },
      {
        "start_time": 870480,
        "end_time": 875120,
        "duration": 4640,
        "text": "डिटेक्शन, इट्स सूटेबल फॉर लीगल डोमेन,"
      },
      {
        "start_time": 872240,
        "end_time": 877199,
        "duration": 4959,
        "text": "इट्स सूटेबल इवन फॉर रिसर्च। बेसिकली दिस"
      },
      {
        "start_time": 875120,
        "end_time": 879519,
        "duration": 4399,
        "text": "टाइप ऑफ आर्किटेक्चर इज सूटेबल फॉर नॉलेज"
      },
      {
        "start_time": 877199,
        "end_time": 881760,
        "duration": 4561,
        "text": "हैवी सिस्टम्स। मतलब ऐसे सिस्टम्स जिसके"
      },
      {
        "start_time": 879519,
        "end_time": 883839,
        "duration": 4320,
        "text": "अंदर देयर आर अ लॉट ऑफ टर्म्स, देयर आर अ"
      },
      {
        "start_time": 881760,
        "end_time": 885519,
        "duration": 3759,
        "text": "लॉट ऑफ थिंग्स व्हिच आर इंटररिलेटेड विथ"
      },
      {
        "start_time": 883839,
        "end_time": 887920,
        "duration": 4081,
        "text": "ईच अदर। फिफ्थ आर्किटेक्चर इज़ कॉल्ड"
      },
      {
        "start_time": 885519,
        "end_time": 889440,
        "duration": 3921,
        "text": "एजेंटिक रैक। नाउ देयर आर सम यूजर क्वेरीज़"
      },
      {
        "start_time": 887920,
        "end_time": 891440,
        "duration": 3520,
        "text": "दैट कांट बी रेसोल्व्ड विथ अ सिंगल"
      },
      {
        "start_time": 889440,
        "end_time": 893600,
        "duration": 4160,
        "text": "रिट्रीवल ऑर अ सिंगल जनरेशन। फॉर"
      },
      {
        "start_time": 891440,
        "end_time": 895839,
        "duration": 4399,
        "text": "एग्जांपल, देयर इज़ अ यूजर हु आस्क, कैन यू"
      },
      {
        "start_time": 893600,
        "end_time": 898240,
        "duration": 4640,
        "text": "एक्सप्लेन द प्राइस हक ऑफ़ गोल्ड इन 2025"
      },
      {
        "start_time": 895839,
        "end_time": 900399,
        "duration": 4560,
        "text": "एंड कंपेयर विद अदर मेटल्स। नाउ, दिस"
      },
      {
        "start_time": 898240,
        "end_time": 902800,
        "duration": 4560,
        "text": "सिंगल क्वेरी कैन नोट बी रेसलॉल्व विद अ"
      },
      {
        "start_time": 900399,
        "end_time": 905120,
        "duration": 4721,
        "text": "सिंगल रिट्रीवल। और कैन नॉट बी रेसोल्व्ड"
      },
      {
        "start_time": 902800,
        "end_time": 906720,
        "duration": 3920,
        "text": "वेल विद अ सिंगल रिट्रीवल। सो द सिस्टम"
      },
      {
        "start_time": 905120,
        "end_time": 908639,
        "duration": 3519,
        "text": "नीड्स टू ब्रेक डाउन दिस क्वेरी इन"
      },
      {
        "start_time": 906720,
        "end_time": 910320,
        "duration": 3600,
        "text": "मल्टीपल पार्ट्स। सबसे पहले तो सिस्टम को"
      },
      {
        "start_time": 908639,
        "end_time": 912959,
        "duration": 4320,
        "text": "फिगर आउट करना पड़ेगा कि व्हेन वाज़ दिस"
      },
      {
        "start_time": 910320,
        "end_time": 915199,
        "duration": 4879,
        "text": "प्राइस हक इन 2025। उसके साथ में इट नीड्स"
      },
      {
        "start_time": 912959,
        "end_time": 917839,
        "duration": 4880,
        "text": "टू फिगर आउट द रीज़न बिहाइंड इट। प्लस इट"
      },
      {
        "start_time": 915199,
        "end_time": 920160,
        "duration": 4961,
        "text": "आल्सो नीड्स टू कंपेयर इट विद अदर मेटल्स।"
      },
      {
        "start_time": 917839,
        "end_time": 922320,
        "duration": 4481,
        "text": "तो बेसिकली वी नाउ हैव अ सेट ऑफ़ मल्टीपल"
      },
      {
        "start_time": 920160,
        "end_time": 924320,
        "duration": 4160,
        "text": "क्वेरीज़। तो वी नीड मल्टीपल रिट्रीवल्स।"
      },
      {
        "start_time": 922320,
        "end_time": 927279,
        "duration": 4959,
        "text": "एंड उसके साथ में सिस्टम विल आल्सो नीड"
      },
      {
        "start_time": 924320,
        "end_time": 929760,
        "duration": 5440,
        "text": "एक्सेस टू सम एडिशनल टूल्स। जैसे वेब सर्च"
      },
      {
        "start_time": 927279,
        "end_time": 931680,
        "duration": 4401,
        "text": "हो गया जैसे फाइनेंस एपीआईस हो गई। तो इस"
      },
      {
        "start_time": 929760,
        "end_time": 933440,
        "duration": 3680,
        "text": "तरीके का जो सिस्टम होता है इट कैन बी"
      },
      {
        "start_time": 931680,
        "end_time": 935199,
        "duration": 3519,
        "text": "बिल्ट विथ द हेल्प ऑफ एजेंटिक रैक। तो"
      },
      {
        "start_time": 933440,
        "end_time": 937519,
        "duration": 4079,
        "text": "एजेंटिक रैक की जब हम बात करते हैं द"
      },
      {
        "start_time": 935199,
        "end_time": 939440,
        "duration": 4241,
        "text": "सिस्टम्स आर मल्टीस्टेप देयर आर मल्टीपल"
      },
      {
        "start_time": 937519,
        "end_time": 941519,
        "duration": 4000,
        "text": "रिट्रीवल्स इनवॉल्व्ड एंड उसके साथ में द"
      },
      {
        "start_time": 939440,
        "end_time": 943199,
        "duration": 3759,
        "text": "सिस्टम नीड्स टू हैव सम लेवल ऑफ ऑटोनोमी"
      },
      {
        "start_time": 941519,
        "end_time": 946079,
        "duration": 4560,
        "text": "फॉर कंप्लीटिंग द टास्क। नेक्स्ट इज़ कॉल्ड"
      },
      {
        "start_time": 943199,
        "end_time": 947839,
        "duration": 4640,
        "text": "अ मल्टीडल रैग। जनरली द स्टैंडर्ड रैग्स"
      },
      {
        "start_time": 946079,
        "end_time": 950240,
        "duration": 4161,
        "text": "दैट वी हैव। दे ओनली वर्क विथ टेक्स्चुअल"
      },
      {
        "start_time": 947839,
        "end_time": 952720,
        "duration": 4881,
        "text": "डेटा। बट डेटा कैन बी इन एनी फॉर्म। सो"
      },
      {
        "start_time": 950240,
        "end_time": 954240,
        "duration": 4000,
        "text": "मल्टीमॉडल रैग इज़ एबल टू प्रोसेस डेटा"
      },
      {
        "start_time": 952720,
        "end_time": 956320,
        "duration": 3600,
        "text": "व्हिच इज़ इन द फॉर्म ऑफ टेक्स्ट, व्हिच इज़"
      },
      {
        "start_time": 954240,
        "end_time": 958480,
        "duration": 4240,
        "text": "इन द फॉर्म ऑफ वीडियोज़, इमेजेस एंड इवन"
      },
      {
        "start_time": 956320,
        "end_time": 960240,
        "duration": 3920,
        "text": "ऑडिओज़। सो, दिस टाइप ऑफ़ रैग आर्किटेक्चर"
      },
      {
        "start_time": 958480,
        "end_time": 962240,
        "duration": 3760,
        "text": "हैज़ ग्रेट यूज़ केसेस इन द मेडिकल"
      },
      {
        "start_time": 960240,
        "end_time": 964399,
        "duration": 4159,
        "text": "इंडस्ट्री व्हेयर वी हैव एक्स रेज़ व्हेयर"
      },
      {
        "start_time": 962240,
        "end_time": 966240,
        "duration": 4000,
        "text": "वी हैव रिपोर्ट्स एंड ऑल्सो इन सर्विलेंस"
      },
      {
        "start_time": 964399,
        "end_time": 968720,
        "duration": 4321,
        "text": "एंड सिक्योरिटी। सो, फाइनली, वी हैव द"
      },
      {
        "start_time": 966240,
        "end_time": 970399,
        "duration": 4159,
        "text": "सेल्फ रैग ऑर द सेल्फ रिफ्लेक्टिव रैग। अब"
      },
      {
        "start_time": 968720,
        "end_time": 972639,
        "duration": 3919,
        "text": "यह जो रैग आर्किटेक्चर है, यह फर्स्ट टाइम"
      },
      {
        "start_time": 970399,
        "end_time": 974480,
        "duration": 4081,
        "text": "में फाइनल आउटपुट को जनरेट नहीं करता। बट,"
      },
      {
        "start_time": 972639,
        "end_time": 975759,
        "duration": 3120,
        "text": "यह फर्स्ट टाइम में जो भी रिस्पांस जनरेट"
      },
      {
        "start_time": 974480,
        "end_time": 977759,
        "duration": 3279,
        "text": "करता है, दैट इज़ कॉल्ड द ड्राफ्ट"
      },
      {
        "start_time": 975759,
        "end_time": 980079,
        "duration": 4320,
        "text": "रिस्पांस। एंड व्हाट दिस टाइप ऑफ़ रैग"
      },
      {
        "start_time": 977759,
        "end_time": 982399,
        "duration": 4640,
        "text": "आर्किटेक्चर डज़ इज़ यह वो ड्राफ्ट रिस्पांस"
      },
      {
        "start_time": 980079,
        "end_time": 984399,
        "duration": 4320,
        "text": "को पहले एनालाइज़ करता है। पहले खुद से"
      },
      {
        "start_time": 982399,
        "end_time": 986480,
        "duration": 4081,
        "text": "क्रिटिक करता है कि इफ दैट रिस्पांस इज़"
      },
      {
        "start_time": 984399,
        "end_time": 988079,
        "duration": 3680,
        "text": "गुड इनफ। क्या और कोई इनफेशन तो फिगर आउट"
      },
      {
        "start_time": 986480,
        "end_time": 989759,
        "duration": 3279,
        "text": "करने की या सर्च करने की जरूरत नहीं है?"
      },
      {
        "start_time": 988079,
        "end_time": 991839,
        "duration": 3760,
        "text": "सो उससे क्या होता है? दिस रैग इज़ एबल टू"
      },
      {
        "start_time": 989759,
        "end_time": 993360,
        "duration": 3601,
        "text": "इंप्रूव द रिस्पांस बाय एनालाइजिंग इट"
      },
      {
        "start_time": 991839,
        "end_time": 995120,
        "duration": 3281,
        "text": "बिफोर हैंड। सो दिस टाइप ऑफ़ रैग"
      },
      {
        "start_time": 993360,
        "end_time": 996639,
        "duration": 3279,
        "text": "आर्किटेक्चर इज़ ग्रेट फॉर इंडस्ट्रीज"
      },
      {
        "start_time": 995120,
        "end_time": 998720,
        "duration": 3600,
        "text": "व्हिच आर रिसर्च हैवी और व्हिच हैव"
      },
      {
        "start_time": 996639,
        "end_time": 1000560,
        "duration": 3921,
        "text": "स्ट्रांग रेगुलेशंस। आल्सो देयर आर मोर"
      },
      {
        "start_time": 998720,
        "end_time": 1002320,
        "duration": 3600,
        "text": "टाइप्स ऑफ़ रैग आर्किटेक्चर दैट एक्सिस्ट।"
      },
      {
        "start_time": 1000560,
        "end_time": 1004399,
        "duration": 3839,
        "text": "सो आई हैव इंक्लूडेड सम ऑफ़ देम इन अ"
      },
      {
        "start_time": 1002320,
        "end_time": 1005759,
        "duration": 3439,
        "text": "पीडीएफ डॉक्यूमेंटेशन जिसका लिंक आपको"
      },
      {
        "start_time": 1004399,
        "end_time": 1007920,
        "duration": 3521,
        "text": "नीचे डिस्क्रिप्शन बॉक्स के अंदर मिल"
      },
      {
        "start_time": 1005759,
        "end_time": 1010079,
        "duration": 4320,
        "text": "जाएगा। उसके साथ में इंडस्ट्री के अंदर"
      },
      {
        "start_time": 1007920,
        "end_time": 1012000,
        "duration": 4080,
        "text": "जनरली इंस्टेड ऑफ़ यूजिंग स्टैंड अलोन"
      },
      {
        "start_time": 1010079,
        "end_time": 1014079,
        "duration": 4000,
        "text": "आर्किटेक्चर्स। व्हाट हैपेंस इज कि"
      },
      {
        "start_time": 1012000,
        "end_time": 1015759,
        "duration": 3759,
        "text": "प्रोडक्शन लेवल पर मल्टीपल आर्किटेक्चर्स"
      },
      {
        "start_time": 1014079,
        "end_time": 1017600,
        "duration": 3521,
        "text": "को भी कंबाइन किया जाता है। सो दैट इज़"
      },
      {
        "start_time": 1015759,
        "end_time": 1019839,
        "duration": 4080,
        "text": "आल्सो अ प्रैक्टिस दैट हेल्प्स इंप्रूव द"
      },
      {
        "start_time": 1017600,
        "end_time": 1022000,
        "duration": 4400,
        "text": "परफॉर्मेंस ऑफ द सिस्टम्स। तो आई होप कि"
      },
      {
        "start_time": 1019839,
        "end_time": 1024000,
        "duration": 4161,
        "text": "आज के सेशन से हमें रैग के बारे में"
      },
      {
        "start_time": 1022000,
        "end_time": 1025679,
        "duration": 3679,
        "text": "कंप्लीट डिटेल पता चली होगी एंड हमें"
      },
      {
        "start_time": 1024000,
        "end_time": 1028160,
        "duration": 4160,
        "text": "क्लियरली समझ में आया होगा कि रैग"
      },
      {
        "start_time": 1025679,
        "end_time": 1030319,
        "duration": 4640,
        "text": "एग्जैक्टली होता क्या है? व्हाई इज़ रैग सो"
      },
      {
        "start_time": 1028160,
        "end_time": 1032160,
        "duration": 4000,
        "text": "पॉपुलर एंड व्हाट आर द पॉपुलर रैग"
      },
      {
        "start_time": 1030319,
        "end_time": 1034079,
        "duration": 3760,
        "text": "आर्किटेक्चर्स दैट एक्सिस्ट इन द"
      },
      {
        "start_time": 1032160,
        "end_time": 1036400,
        "duration": 4240,
        "text": "इंडस्ट्री। इसके बाद इफ यू हैव एनी डाउट्स"
      },
      {
        "start_time": 1034079,
        "end_time": 1038319,
        "duration": 4240,
        "text": "रिलेटेड टू रैग और एआई? और इफ यू नीड अ"
      },
      {
        "start_time": 1036400,
        "end_time": 1040000,
        "duration": 3600,
        "text": "कंप्लीट टुटोरियल टू इंप्लीमेंट रैग"
      },
      {
        "start_time": 1038319,
        "end_time": 1041439,
        "duration": 3120,
        "text": "यूजिंग Python, यू कैन लेट मी नो इन द"
      },
      {
        "start_time": 1040000,
        "end_time": 1044000,
        "duration": 4000,
        "text": "कमेंट्स। आज के लिए इतना ही। मिलते हैं"
      },
      {
        "start_time": 1041439,
        "end_time": 1044000,
        "duration": 2561,
        "text": "नेक्स्ट सेशन के अंदर।"
      }
    ],
    "hashtags": null,
    "tags": [
      "C++",
      "C++ coding",
      "C++ full course",
      "C++ placement course",
      "how to code",
      "programming",
      "college placement course",
      "C++ language",
      "java",
      "java language",
      "java full course",
      "java placement",
      "java code",
      "java coding"
    ],
    "next_recommended_videos": null,
    "recommended_videos": [
      {
        "url": "https://www.youtube.com/watch?v=swvzKSOEluc&pp=ugUHEgVlbi1HQg%3D%3D",
        "title": "RAG Crash Course for Beginners",
        "thumbnail": "https://i.ytimg.com/vi/swvzKSOEluc/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLDSGuIDYGgAEYZxQ_Br9EjpddAoWw"
      },
      {
        "url": "https://www.youtube.com/watch?v=jNJH6uD5LQE",
        "title": "Generative AI vs Agentic AI vs AI Agents",
        "thumbnail": "https://i.ytimg.com/vi/jNJH6uD5LQE/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLA2ypFKbUaNcSfAA-4PXRsFT2PW7g"
      },
      {
        "url": "https://www.youtube.com/watch?v=PpAk8f-DNTc&pp=0gcJCT8LAYcqIYzv",
        "title": "RAG Explained in 20 Minutes | Retrieval Augmented Generation (RAG) Complete Tutorial | AI & GenAI",
        "thumbnail": "https://i.ytimg.com/vi/PpAk8f-DNTc/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLCVklqwk4OXT_uNxhw6i1_8AanjJQ"
      },
      {
        "url": "https://www.youtube.com/watch?v=dDkynerzV-Q&pp=ugUEEgJlbg%3D%3D",
        "title": "RAG Explained | All about RAG - Retrieval Augmented Generation",
        "thumbnail": "https://i.ytimg.com/vi/dDkynerzV-Q/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLBuyzH9jKVVoULjeE4FT7Glx9o_DQ"
      },
      {
        "url": "https://www.youtube.com/watch?v=E2DEHOEbzks&pp=ugUHEgVlbi1HQg%3D%3D",
        "title": "Model Context Protocol (MCP) Explained for Beginners: AI Flight Booking Demo!",
        "thumbnail": "https://i.ytimg.com/vi/E2DEHOEbzks/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLAIs8pjP2170VzRH4PshBqAbqzs4w"
      },
      {
        "url": "https://www.youtube.com/watch?v=OYvlznJ4IZQ&pp=ugUEEgJlbg%3D%3D",
        "title": "20 AI Concepts Explained in 40 Minutes",
        "thumbnail": "https://i.ytimg.com/vi/OYvlznJ4IZQ/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLBfTaOfPWhkzJORc056QK5p9BxXcw"
      },
      {
        "url": "https://www.youtube.com/watch?v=1XndoFz9Y6A",
        "title": "Build Multi-Document RAG System 🔥 | Chat with PDFs  (LangChain + LLM) AI Chatbot (Step-by-Step)",
        "thumbnail": "https://i.ytimg.com/vi/1XndoFz9Y6A/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLAkCpyK5sl82XLw9MvIOGIIdYYm6w"
      },
      {
        "url": "https://www.youtube.com/watch?v=H8Lyj2D_cWo",
        "title": "What is Docker? Simply Explained by Shradha Ma'am",
        "thumbnail": "https://i.ytimg.com/vi/H8Lyj2D_cWo/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLB5CVrNAbbHA7Q7n-jkHKr0u-Fhsw"
      },
      {
        "url": "https://www.youtube.com/watch?v=UabBYexBD4k",
        "title": "Is RAG Still Needed? Choosing the Best Approach for LLMs",
        "thumbnail": "https://i.ytimg.com/vi/UabBYexBD4k/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLDCna93ZNKrD5duWrvKje8hNJ5sHw"
      },
      {
        "url": "https://www.youtube.com/watch?v=fZM3oX4xEyg&pp=ugUEEgJlbg%3D%3D",
        "title": "Introduction To Undertsanding RAG(Retrieval-Augmented Generation)",
        "thumbnail": "https://i.ytimg.com/vi/fZM3oX4xEyg/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLAOa2y1RKlgT0HUQpUyfs2Hx1yZ5g"
      },
      {
        "url": "https://www.youtube.com/watch?v=I7_WXKhyGms",
        "title": "RAG & MCP Fundamentals – A Hands-On Crash Course",
        "thumbnail": "https://i.ytimg.com/vi/I7_WXKhyGms/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLCwztsBMzkyp9vZsWm0EVeA4Mm8ow"
      },
      {
        "url": "https://www.youtube.com/watch?v=8ib4Qnh2HFE",
        "title": "Full AI Prompting Course with Andrew Ng",
        "thumbnail": "https://i.ytimg.com/vi/8ib4Qnh2HFE/hqdefault.jpg?sqp=-oaymwEnCNACELwBSFryq4qpAxkIARUAAIhCGAHYAQHiAQoIGBACGAY4AUAB&rs=AOn4CLBSxL6f0uIJ6bW-p9G4vBiI9HRdTQ"
      }
    ],
    "transcript_language": [
      {
        "language": "Hindi (auto-generated)",
        "auto_translate": true
      }
    ],
    "chapters": [
      {
        "title": "RAG Explained",
        "time_stamp": null,
        "image": "https://i.ytimg.com/vi/Ty8gcCKuwNI/hqdefault_3200.jpg?sqp=-oaymwEmCKgBEF5IWvKriqkDGQgBFQAAiEIYAdgBAeIBCggYEAIYBjgBQAE=&rs=AOn4CLBj47WIVTZlcAP60T7B_WGZfscoNQ"
      },
      {
        "title": "RAG Benefits over Traditional LLM",
        "time_stamp": "225000",
        "image": "https://i.ytimg.com/vi/Ty8gcCKuwNI/hqdefault_246100.jpg?sqp=-oaymwEmCKgBEF5IWvKriqkDGQgBFQAAiEIYAdgBAeIBCggYEAIYBjgBQAE=&rs=AOn4CLA3Tj7M2K_WR4iuk2c7SAPl-KkE6w"
      },
      {
        "title": "Complete RAG Pipeline",
        "time_stamp": "360000",
        "image": "https://i.ytimg.com/vi/Ty8gcCKuwNI/hqdefault_376233.jpg?sqp=-oaymwEmCKgBEF5IWvKriqkDGQgBFQAAiEIYAdgBAeIBCggYEAIYBjgBQAE=&rs=AOn4CLCfaZw7uJD6HlFo4VzbBl_ud3jEZw"
      },
      {
        "title": "Tech Implementation Pillars",
        "time_stamp": "653000",
        "image": "https://i.ytimg.com/vi/Ty8gcCKuwNI/hqdefault_657833.jpg?sqp=-oaymwEmCKgBEF5IWvKriqkDGQgBFQAAiEIYAdgBAeIBCggYEAIYBjgBQAE=&rs=AOn4CLA2_8W6hAqAFccgGxxrX0id7HYBYQ"
      },
      {
        "title": "RAG Architecture & Use cases",
        "time_stamp": "741000",
        "image": "https://i.ytimg.com/vi/Ty8gcCKuwNI/hqdefault_762000.jpg?sqp=-oaymwEmCKgBEF5IWvKriqkDGQgBFQAAiEIYAdgBAeIBCggYEAIYBjgBQAE=&rs=AOn4CLDIy6bjCWwTMPuSAxrsrbaVqjM1HA"
      }
    ],
    "transcription_language": null,
    "is_age_restricted": false,
    "channel_url_decoded": "https://www.youtube.com/@ApnaCollegeOfficial",
    "category": "Education",
    "audio_tracks": [],
    "made_for_kids": false,
    "player_notification_text": null,
    "ai_content_label": false,
    "timestamp": "2026-06-24T11:03:48.320Z",
    "input": {
      "url": "https://www.youtube.com/watch?v=Ty8gcCKuwNI",
      "country": "",
      "transcription_language": ""
    }
  }
]